Repository: ministryofjustice/cla_public
Catalog: cla_public/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: This policy is under regular review. Any changes made to the privacy policy will be posted here and, where appropriate, <abbr>CLA</abbr> staff will be notified by email.
cy: Mae’r polisi hwn yn cael ei adolygu’n rheolaidd. Bydd unrhyw newidiadau yn y polisi preifatrwydd yn cael eu dangos yma ac, os yw’n briodol, bydd staff <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yn cael eu hysbysu drwy’r e-bost

source: Complaints about this statement
cy: Cwynion am y datganiad hwn

source: If you would like to make a complaint about this statement and how it applies to you then please contact <abbr title="Civil Legal Advice">CLA</abbr> on <span class="tel">0345 345 4 345</span>.
cy: Os ydych chi’n dymuno gwneud cwyn am y datganiad hwn a’r ffordd y mae’n cael ei gymhwyso i chi, cysylltwch â <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> ar 0345 345 4 345.

source: Why do you want to contact Civil Legal Advice?
cy: Pam eich bod eisiau cysylltu â’r gwasanaeth Cyngor Cyfreithiol Sifil?

source: You’ve reached the end of this service
cy: Rydych wedi cyrraedd diwedd y gwasanaeth hwn

source: For your security, the information you’ve entered has automatically been deleted.
cy: Er eich diogelwch chi, mae’r wybodaeth a fewnbynnwyd gennych yn cael ei dileu’n awtomatig.

source: You can start again below.
cy: Gallwch ddechrau eto isod.

source: Start again
cy: Dechrau eto

source: Current page
cy: Tudalen gyfredol

source: Completed page
cy: Tudalen wedi’i chwblhau

source: Future page
cy: Tudalen i’r dyfodol

source: Final page
cy: Tudalen olaf

source: Approximately %(approximate_percentage)s&#37; completed
cy: Cwblhawyd tua %(approximate_percentage)s&#37;

source: Your progress
cy: Eich cynnydd

source: Contact information
cy: Gwybodaeth gyswllt

source: Are you in a dispute with your partner?
cy: Ydych chi mewn anghydfod â’ch partner?

source: How many?
cy: Faint?

source: You’ll need to provide evidence of the financial information you’ve given us through this service.
cy: Bydd angen i chi ddarparu tystiolaeth o’r wybodaeth ariannol yr ydych wedi ei rhoi i ni drwy’r gwasanaeth hwn.

source: Total amount of benefits not listed above
cy: Cyfanswm y budd-daliadau sydd ddim wedi’i restru uchod

source: Enter the total amount you receive
cy: Rhowch y cyfanswm yr ydych yn ei gael

source: We only need to know about any money you received last month, even if this varies from month to month.
cy: Dim ond gwybodaeth am unrhyw arian yr ydych wedi ei dderbyn y mis diwethaf yr ydym ei angen, hyd yn oed os yw’n amrywio o fis i fis.

source: Your money
cy: Eich arian

source: Give details of any money that is paid to you personally, like your wages. Record money coming in for your partner in the next section.
cy: Rhowch fanylion am unrhyw arian sy’n cael ei dalu i chi’n bersonol, er enghraifft eich cyflog. Dylech gofnodi arian y mae eich partner yn ei ennill yn yr adran nesaf.

source: Your partner’s money
cy: Arian eich partner

source: Please tell us about any property owned by you, your partner or both of you.
cy: Rhowch wybod i ni am unrhyw eiddo yr ydych chi, eich partner neu’r ddau ohonoch yn berchen arno

source: You can add more than one property below.
cy: Gallwch ychwanegu mwy nag un eiddo isod.

source: Property
cy: Eiddo

source: Remove property
cy: Dileu eiddo

source: Add another property
cy: Ychwanegu eiddo arall

source: How much rent did you receive last month?
cy: Faint o rent wnaethoch chi ei dderbyn y mis diwethaf?

source: Summary of your answers
cy: Crynodeb o’ch atebion

source: Your problem area
cy: Maes eich problem

source: Change
cy: Newid

source: answer for
cy: ateb:

source: Confirm
cy: Cadarnhau

source: Any cash, savings or investments held in your name, your partner’s name or both your names.
cy: Unrhyw arian parod, cynilion neu fuddsoddiadau sy’n cael eu dal yn eich enw chi, enw’ch partner neu yn enwau’r ddau ohonoch.

source: We need to know about any money you have saved or invested.
cy: Mae arnom angen gwybod am unrhyw arian yr ydych wedi’i gynilo neu fuddsoddi

source: Your session will time out after 30 minutes of inactivity. We do this for your security.
cy: Bydd eich sesiwn yn dod i ben os yw wedi bod yn anweithredol am hanner awr. Rydym yn gwneud hyn er mwyn eich cadw’n ddiogel.

source: No results returned for the Isle of Man, try a postcode in England or Wales
cy: Dim canlyniadau wedi’u dychwelyd ar gyfer Ynys Manaw. Rhowch gynnig ar gôd post yng Nghymru neu Loegr.

source: No results returned for Jersey, try a postcode in England or Wales
cy: Dim canlyniadau wedi’u dychwelyd ar gyfer Jersey. Rhowch gynnig ar gôd post yng Nghymru neu Loegr.

source: No results returned for Guernsey, try a postcode in England or Wales
cy: Dim canlyniadau wedi’u dychwelyd ar gyfer Ynys y Garn. Rhowch gynnig ar gôd post yng Nghymru neu Loegr.

source: Postcode not found
cy: Heb ddod o hyd i gôd post

source: Enter a postcode
cy: Rhowch gôd post

source: Legal adviser search results
cy: Canlyniadau Chwilio Cynghorydd Cyfreithiol

source: Search again
cy: Chwilio eto

source: Search
cy: Chwilio

source: Legal Aid is different in Scotland. Visit %(link)s for more information.
cy: Mae Cymorth Cyfreithiol yn wahanol yn Yr Alban. Ewch i %(link)s i gael rhagor o wybodaeth.

source: Legal Aid is different in Northern Ireland. Visit %(link)s for more information.
cy: Mae Cymorth Cyfreithiol yn wahanol yng Ngogledd Iwerddon. Ewch i %(link)s i gael rhagor o wybodaeth.

source: Legal Aid is different on the Isle of Man. Visit %(link)s for more information.
cy: Mae Cymorth Cyfreithiol yn wahanol yn Ynys Manaw. Ewch i %(link)s i gael rhagor o wybodaeth.

source: Legal Aid is different in Jersey. Visit %(link)s for more information.
cy: Mae Cymorth Cyfreithiol yn wahanol yn Jersey. Ewch i %(link)s i gael rhagor o wybodaeth.

source: Legal Aid is different in Guernsey. Visit %(link)s for more information.
cy: Mae Cymorth Cyfreithiol yn wahanol yn Ynys y Garn. Ewch i %(link)s i gael rhagor o wybodaeth.

source: Showing %(count)s results around
cy: Dangos %(count)s canlyniadau o amgylch

source: for
cy: ar gyfer

source: Distance
cy: Pellter

source: %(miles)s miles
cy: %(miles)s milltir

source: Categories of law
cy: Categoriau cyfraith

source: Helpline
cy: Llinell Gymorth

source: Website
cy: Gwefan

source: Previous
cy: Blaenorol

source: Next
cy: Nesaf

source: No results
cy: Dim canlyniadau

source: We couldn’t find any results for your search. We are constantly updating our records so please try again later.
cy: Doedd dim modd i ni ddod o hyd i unrhyw ganlyniadau ar gyfer eich chwiliad. Rydyn ni’n diweddaru ein cofnodion yn gyson, felly rhowch gynnig arall arni yn nes ymlaen.

source: Loading…
cy: Llwytho…

source: We will call you back
cy: Byddwn yn eich ffonio’n ôl

source: Your details have been submitted
cy: Cyflwynwyd eich manylion

source: Your reference number is
cy: Eich cyfeirnod yw

source: You can now call CLA on
cy: Gallwch ffonio <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yn awr ar

source: Please quote your reference number when you call. Find out about <a class="govuk-link" href="https://www.gov.uk/call-charges" rel="external">call charges</a>.
cy: Dyfynnwch eich cyfeirnod pan fyddwch yn ffonio. <a href="https://www.gov.uk/costau-galwadau" rel="external">I gael rhagor o wybodaeth am gyfraddau galwadau</a>."

source: Your reference number was sent to
cy: Anfonwyd eich cyfeirnod i

source: Send
cy: Anfon

source: If you have a court hearing date it is important that you get advice as soon as possible. You may be able to get last-minute help on the day of the hearing from an adviser in the court building.
cy: Os oes gennych ddyddiad gwrandawiad llys, mae’n bwysig eich bod yn cael cyngor cyn gynted â phosib. Efallai y cewch gymorth ar fyr rybudd ar ddiwrnod y gwrandawiad gan gynghorydd yn adeilad y llys.

source: What happens next?
cy: Beth sy’n di?

source: Your details have been submitted and an operator will call the person you nominated at least once during your chosen time, or as close to the time as possible
cy: Mae eich manylion wedi cael eu cyflwyno a bydd gweithredwr yn eich ffonio o leiaf unwaith ar yr adeg o’ch dewis, neu mor agos at yr adeg honno ag sy’n bosibl

source: Your details have been submitted and an operator will call you at least once during your chosen time, or as close to the time as possible
cy: Mae eich manylion wedi cael eu cyflwyno a bydd gweithredwr yn eich ffonio o leiaf unwaith ar yr adeg o’ch dewis, neu mor agos at yr adeg honno ag sy’n bosibl

source: When a CLA operator calls, the call will come from an anonymous number.
cy: Pan fydd gweithredwr <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yn eich ffonio, bydd rhif anhysbys yn ymddangos ar yr alwad.

source: If you need to urgently protect yourself or your family you should try and get advice as soon as possible.
cy: Os oes arnoch angen diogelu chi’ch hun neu eich teulu ar frys, dylech geisio cael cymorth cyn gynted â phosib

source: The first person they speak to will be an operator who will ask about your problem and your financial circumstances.
cy: Yr unigolyn cyntaf fydd yn siarad â hwy fydd gweithredwr a fydd yn gofyn cwestiynau am eich problem a’ch amgylchiadau ariannol

source: The first person you speak to will be an operator who will ask about your problem and your financial circumstances.
cy: Yr unigolyn cyntaf fydd yn siarad â chi fydd gweithredwr a fydd yn gofyn cwestiynau i chi am eich problem a’ch amgylchiadau ariannol.

source: If it looks like you might qualify for legal aid they’ll be put through to a specialist adviser, who will make the final decision on your case.
cy: Os yw’n ymddangos y gallech chi fod yn gymwys am gymorth cyfreithiol, fe’ch trosglwyddir i un o gynghorwyr arbenigol a fydd yn gwneud y penderfyniad terfynol ynghylch eich achos.

source: If it looks like you might qualify for legal aid you’ll be put through to a specialist adviser, who will make the final decision on your case.
cy: Os yw’n ymddangos y gallech chi fod yn gymwys am gymorth cyfreithiol, fe’ch trosglwyddir i un o gynghorwyr arbenigol a fydd yn gwneud y penderfyniad terfynol ynghylch eich achos.

source: Please be aware that the specialist adviser will need evidence of the domestic violence before they can make a decision on your case.
cy: Byddwch yn ymwybodol fod y cynghorydd arbenigol angen tystiolaeth o’r trais domestig cyn y gallant wneud penderfyniad ar eich achos.

source: Find out what you can use as evidence
cy: Canfod beth allwch ei ddefnyddio fel tystiolaeth

source: If your case involves domestic abuse or violence, the specialist adviser will need evidence of this before they can make a decision on your case.
cy: Os yw eich cais yn ymwneud â cham-drin neu drais domestig, bydd y cynghorydd arbenigol angen tystiolaeth o hyn cyn gwneud penderfyniad ynghylch eich achos.

source: You will also need to provide evidence of your financial circumstances. Your specialist adviser will explain what is needed.
cy: Bydd angen i chi ddarparu tystiolaeth o’ch amgylchiadau ariannol hefyd. Bydd eich cynghorydd arbenigol yn egluro beth sydd ei angen.

source: You will need to provide evidence of your financial circumstances and maybe your problem. Your specialist adviser will explain what is needed.
cy: Bydd angen i chi ddarparu tystiolaeth o’ch amgylchiadau ariannol ac efallai eich problem. Bydd eich cynghorydd arbenigol yn esbonio beth fyddwch ei angen.

source: If your specialist adviser thinks you need to speak to someone in person or have someone represent you in court, they will organise this.
cy: Os bydd eich cynghorydd arbenigol yn penderfynu bod angen i chi siarad â rhywun eich hun neu os bydd arnoch angen rhywun i’ch cynrychioli yn y llys, fe fydd yn trefnu hyn.

source: If CLA can’t help you, we’ll always suggest where else you might get help.
cy: Os nad yw <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yn gallu eich helpu, byddwn ni bob amser yn awgrymu rhywle arall allai’ch helpu.

source: If we can do anything to make it easier for you to communicate with us, please tell the operator.
cy: Os gallwn wneud unrhyw beth i’w gwneud hi’n haws i chi gyfathrebu gyda ni, dywedwch wrth y gweithredwr.

source: Protecting your personal data and your privacy is important to us. Read the full <a class="govuk-link" href="%(privacy_link)s">Civil Legal Advice Privacy Statement</a>.
cy: Mae diogelu’ch data personol a phreifatrwydd yn bwysig i ni. Darllennwch y <a class="govuk-link" href="%(privacy_link)s">Datganiad Preifatrwydd Cyngor Cyfreithiol yn llawn</a>.

source: What if I miss the operator’s call?
cy: Beth fydd yn digwydd os byddaf yn methu galwad y gweithredwr?

source: If you miss the call or you need advice urgently, you can call us on <strong>0345 345 4 345</strong>. Find out about <a class="govuk-link" href="https://www.gov.uk/call-charges" rel="external">call charges</a>.
cy: Os byddwch yn methu’r alwad neu angen cyngor ar frys, gallwch ein ffonio ar 0345 345 4 345. <a class="govuk-link" href="https://www.gov.uk/costau-galwadau">Mae gwybodaeth am gostau’r galwadau i’w cael yma.</a>

source: Finish
cy: Gorffen

source: Print this page
cy: Argraffu’r dudalen hon

source: You might qualify for legal aid
cy: Gallech chi fod yn gymwys i gael cymorth cyfreithiol

source: Civil Legal Advice does not provide advice about issues related to welfare benefits but you may be able to get free advice from a legal adviser in your area.
cy: Nid yw Cyngor Cyfreithiol Sifil yn darparu cyngor ynghylch materion sy’n berthnasol i fudd-daliadau lles, ond efallai y cewch gyngor am ddim gan gynghorydd cyfreithiol yn eich ardal.

source: To get advice about appealing a decision made by the social security tribunal about your benefits to the Upper Tribunal, Court of Appeal or Supreme Court, you should contact a legal adviser.
cy: I gael cyngor am apelio penderfyniad a wnaethpwyd gan y tribiwnlys nawdd cymdeithasol am eich budd-daliadau i’r Uwch Dribiwnlys, y Llys Apêl neu’r Goruchaf Lys, dylech gysylltu â chynghorydd cyfreithiol.

source: Your adviser will check whether you qualify for legal aid at no cost to you. If you qualify for legal aid, you will not have to pay for legal advice.
cy: Bydd eich cynghorydd yn gwirio a ydych chi’n gymwys i gael cymorth cyfreithiol am ddim. Os ydych yn gymwys am gymorth cyfreithiol, ni ddylech chi orfod talu am gyngor cyfreithiol.

source: If you don’t qualify for legal aid, you will have to pay for legal advice. You should ask your adviser about the cost of their advice.
cy: Os nad ydych yn gymwys i gael Cymorth Cyfreithiol, bydd rhaid ichi dalu am gyngor cyfreithiol. Dylech holi gyda’ch cynghorydd am gost eu cyngor.

source: To decide whether you might qualify for legal aid, we need more information about your financial circumstances. Contact Civil Legal Advice (CLA), a national helpline for England and Wales to get specialist advice.
cy: Er mwyn penderfynu a allech chi fod yn gymwys i gael cymorth cyfreithiol, mae arnom angen rhagor o wybodaeth am eich amgylchiadau ariannol. Cysylltwch â Chyngor Cyfreithiol Sifil (<abbr>CLA</abbr>), llinell gymorth genedlaethol ar gyfer Cymru a Lloegr, i gael cyngor arbenigol.

source: Based on the answers you’ve given today, you might qualify for legal aid. Contact Civil Legal Advice (CLA), a national helpline for England and Wales, to confirm that you qualify, and get specialist advice if you do.
cy: Yn seiliedig ar eich atebion heddiw, efallai y byddwch yn gymwys i gael cymorth cyfreithiol. Cysylltwch â Chyngor Cyfreithiol Sifil (<abbr>CLA</abbr>), llinell gymorth ar gyfer Cymru a Lloegr, i gael gwybod yn sicr aydych yn gymwys, a chael cyngor arbenigol os ydych yn gymwys.

source: In some cases, you may need to pay a contribution towards your legal aid.
cy: Mewn rhai achosion, os ydych yn gymwys, mae’n bosibl y bydd angen i chi dalu cyfraniad tuag at eich cymorth cyfreithiol.

source: Complete your application by submitting your details below.
cy: Cwblhewch eich cais drwy gyflwyno eich manylion isod.

source: You can choose to contact CLA yourself and speak to someone immediately (this is an 0345 number - %(call_charges_link)s apply) or ask us to call you back, which is free.
cy: Gallwch ddewis cysylltu â <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> eich hun a siarad â rhywun ar unwaith (mae hwn yn rhif 0345 - %(call_charges_link)s) neu gallwch ofyn i ni eich ffonio yn ôl, sydd yn rhad ac am ddim.

source: Results for
cy: Canlyniadau ar gyfer

source: Seek legal advice
cy: Ceisio cyngor cyfreithiol

source: A legal adviser may be able to help you
cy: Efallai gall cynghorydd cyfreithiol eich helpu

source: You will usually only get legal aid for advice about clinical negligence if your child has suffered a brain injury during pregnancy, birth or in the first 8 weeks of life.
cy: Fel arfer, dim ond os yw’ch plentyn wedi cael anaf i’r ymennydd yn ystod beichiogrwydd, genedigaeth neu yn ystod 8 wythnos gyntaf ei fywyd y byddwch chi’n cael cymorth cyfreithiol ar gyfer cyngor ar esgeuluster clinigol.

source: What happens next
cy: Beth sy’n di

source: You should contact a legal aid adviser in your area, who may be able to help.
cy: Dylech gysylltu â chynghorydd cymorth cyfreithiol yn eich ardal, all eich cynorthwyo o bosib.

source: Legal aid is not usually available for advice about personal injury
cy: Fel arfer ni fydd cymorth cyfreithiol ar gael ar gyfer cyngor ar anafiadau personol.

source: You may be able to get legal aid in exceptional cases. You could seek advice from a legal adviser about whether an application might succeed in your case and how to apply.
cy: Efallai y bydd cymorth cyfreithiol yn dal ar gael mewn achosion eithriadol. Gallech chi ofyn am gyngor gan gynghorydd cyfreithiol ynghylch a fydd cais am gymorth cyfreithiol yn debygol o lwyddo yn eich achos chi a sut i wneud cais.

source: Your adviser will check whether you qualify for legal aid <strong>at no cost to you</strong> by asking about your problem and your finances.
cy: Bydd eich cynghorydd yn gwirio a ydych chi’n gymwys i gael cymorth cyfreithiol am ddim drwy ofyn cwestiynau i chi am eich problem a’ch amgylchiadau ariannol.

source: In some cases you may need to pay a contribution towards your legal aid.
cy: Mewn rhai achosion, efallai y bydd yn rhaid i chi wneud cyfraniad ariannol tuag at eich cymorth cyfreithiol

source: What did you think of this service?
cy: Beth oeddech chi’n feddwl o’r gwasanaeth hwn?

source: (takes 30 seconds)
cy: (mae’n cymryd 30 eiliad)

source: If you’re applying for legal aid for a mental health issue, the requirements for the financial assessment are less rigorous than for other legal aid problems.
cy: Os ydych yn gwneud cais am gymorth cyfreithiol ar gyfer problem iechyd meddwl, nid yw’r gofynion ar gyfer yr asesiad ariannol mor llym o’i gymharu â phroblemau cymorth cyfreithiol eraill.

source: Parent or guardian
cy: Rhiant neu warcheidwad

source: Family member or friend
cy: Aelod o’ch teulu neu ffrind

source: Professional
cy: Gweithiwr proffesiynol

source: Legal adviser
cy: Cynghorydd cyfreithiol

source: Other
cy: Arall

source: Monday
cy: Dydd Llun

source: Tuesday
cy: Dydd Mawrth

source: Wednesday
cy: Dydd Mercher

source: Thursday
cy: Dydd Iau

source: Friday
cy: Dydd Gwener

source: Saturday
cy: Dydd Sadwrn

source: Sunday
cy: Dydd Sul

source: You can still ask a legal adviser for help – you will have to pay for their advice.
cy: Gallwch dal ofyn i gyfreithiwr eich helpu - bydd rhaid ichi dalu am eu cyngor.

source: Find a solicitor
cy: Dod o hyd i gyfreithiwr

source: Dear %(full_name)s,
cy: Annwyl %(full_name)s,

source: Your details have been submitted to Civil Legal Advice (CLA) and we will call you back.
cy: Cyflwynwyd eich manylion i Gyngor Cyfreithiol Sifil (<abbr>CLA</abbr>) a byddwn yn eich ffonio’n ôl.

source: Your reference number is %(case_ref)s.
cy: Eich cyfeirnod yw %(case_ref)s.

source: An operator will try to call you back on %(contact_number)s during your chosen time (%(date_time)s).
cy: Bydd gweithredwr yn ceisio eich ffonio’n ôl ar %(contact_number)s yn ystod yr amser a ddewiswyd gennych, sef (%(date_time)s).

source: An operator will try to call you back during your chosen time (%(date_time)s).
cy: Bydd gweithredwr yn ceisio eich ffonio’n ôl yn ystod yr amser a ddewiswyd gennych, sef (%(date_time)s).

source: An operator will try to call %(full_name)s back on %(contact_number)s during your chosen time (%(date_time)s).
cy: Bydd gweithredwr yn ceisio ffonio %(full_name)s yn ôl ar %(contact_number)s yn ystod yr amser a ddewiswyd gennych, sef (%(date_time)s).

source: An operator will try to call the person you nominated back during your chosen time (%(date_time)s).
cy: Bydd gweithredwr yn ceisio ffonio’r unigolyn a enwebwyd gennych chi’n ôl yn ystod yr amser a ddewiswyd gennych, sef (%(date_time)s).

source: We will not leave a message when we call.
cy: Ni fyddwn yn gadael neges pan fyddwn yn eich ffonio.

source: If you miss the call or you need advice urgently, you can call us on 0345 345 4345. Please quote your reference number when you call.
cy: Os byddwch yn methu’r alwad neu angen cyngor ar frys, gallwch ein ffonio ar 0345 345 4345. Dyfynnwch eich cyfeirnod pan fyddwch yn ffonio.

source: Your details have been submitted to Civil Legal Advice (CLA).
cy: Cyflwynwyd eich manylion i Gyngor Cyfreithiol Sifil (<abbr>CLA</abbr>).

source: Your reference number is %(case_ref)s.
cy: Eich cyfeirnod yw %(case_ref)s.

source: You can now call CLA on 0345 345 4 345. Please quote your reference number when you call.
cy: Gallwch ffonio <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> nawr ar 0345 345 4 345. Dyfynnwch eich cyfeirnod pan fyddwch yn ffonio.

source: Take a short survey. Help improve the service.
cy: Cymerwch ran mewn arolwg byr. Helpwch ni i wella’r gwasanaeth.

source: This is an automated email. Please do not reply to this email address.
cy: Mae hwn yn e-bost awtomataidd. Peidiwch ag ateb i’rcyfeiriad e-bost hwn.

source: Page not found
cy: Ni chanfuwyd y dudalen

source: Sorry, this page doesn’t exist
cy: Mae’n ddrwg gennym, nid yw’r dudalen hon yn bodoli

source: Please return to the <a class="govuk-link" href="/">Can I get legal aid?</a> page and try again.
cy: Ewch yn ôl i’r dudalen <a class="govuk-link" href="/">Alla’i gael cymorth cyfreithiol</a>, a rhowch gynnig arall arni.

source: Please return to the <a class="govuk-link" href="/">Find out if Civil Legal Advice can help you</a> page and try again.
cy: Ewch yn ôl i’r dudalen <a class="govuk-link" href="/">Alla’i gael cymorth cyfreithiol</a>, a rhowch gynnig arall arni.

source: Sorry, there is a problem with the service
cy: Mae’n ddrwg gennym, mae problem gyda’r gwasanaeth

source: Try again later.
cy: Rhowch gynnig arall arni yn hwyrach ymlaen.

source: We have not saved any information you have entered. When the service is available, you will have to start again.
cy: Nid ydym wedi cadw unrhyw wybodaeth rydych wedi’i rhoi. Pan fydd y gwasanaeth ar gael, bydd rhaid ichi gychwyn eto.

source: Contact the Civil Legal Advice Helpline if you need urgent information or advice.
cy: Cysylltwch â’r Llinell Gymorth Cyngor Cyfreithiol Sifil os oes angen gwybodaeth neu gyngor brys arnoch chi.

source: Textphone:
cy: Ffôn Testun:

source: Calls will cost approximately 9p per minute from landline. Calls from mobiles may cost more.
cy: Bydd galwadau yn costio oddeutu 9c y funud o linell dir. Bydd galwadau o ffonau symudol yn costio mwy fel arfer.
