Repository: ministryofjustice/cla_public
Catalog: cla_public/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: This field is required.
cy: Rhaid cwblhau’r maes hwn

source: Choose the option that best describes your debt problem
cy: Dewiswch yr opsiwn sy’n disgrifio orau eich problem dyled

source: Choose the option that best describes your personal situation
cy: Dewiswch yr opsiwn sy’n disgrifio orau eich sefyllfa bersonol

source: Are you or your children at immediate risk of harm?
cy: Ydych chi neu eich plant mewn perygl uniongyrchol o niwed?

source: On what grounds have you been discriminated against?
cy: Ar ba sail y gwahaniaethwyd yn eich erbyn?

source: How old are you?
cy: Faint yw eich oed?

source: Where did the discrimination occur?
cy: Ym mhle ddigwyddodd y gwahaniaethu?

source: What is your education problem about?
cy: Beth yw eich problem ynglŷn ag addysg?

source: What is your employment problem about?
cy: Beth yw eich problem ynglŷn â chyflogaeth?

source: What is your family problem about?
cy: Beth yw eich problem teuluol?

source: Select the option that best describes your situation
cy: Dewiswch yr opsiwn sy’n disgrifio eich sefyllfa orau

source: Choose the option that best describes your situation
cy: Dewiswch yr opsiwn sy’n disgrifio eich sefyllfa orau

source: Are you at immediate risk of harm?
cy: Ydych chi mewn perygl uniongyrchol o niwed?

source: Have you already started family mediation? (This includes cases that have already finished)
cy: Ydych chi wedi dechrau cyfryngu teuluol eisoes? (Mae hyn yn cynnwys achosion sydd wedi dod i ben eisoes)

source: Have you taken part in a family mediation session?
cy: Ydych chi wedi cymryd rhan mewn sesiwn cyfryngu i deuluoedd?

source: What kind of dispute is it?
cy: Pa fath o anghydfod ydyw?

source: Is the child a victim of child abuse within the family?
cy: A yw’r plentyn yn ddioddefwr cam-drin plant o fewn y teulu?

source: Is the local council trying to take your child into care?
cy: Yw’r cyngor lleol yn ceisio rhoi eich plentyn mewn gofal?

source: Choose the option that best describes your housing situation
cy: Dewiswch yr opsiwn sy’n disgrifio orau eich sefyllfa tai

source: Are you at risk of losing your home because of bankruptcy, repossession or mortgage debt?
cy: Ydych chi mewn perygl o golli eich cartref oherwydd methdaliad, ailfeddiannu neu ddyled morgais?

source: What is your housing problem about?
cy: Beth yw eich problem ynglŷn â thai?

source: Does this create a serious risk of illness or injury?
cy: A yw hyn yn creu perygl difrifol o salwch neu anaf?

source: Your landlord is:
cy: Eich landlord yw:

source: What is your benefits problem about?
cy: Beth yw eich problem ynglŷn â budd-daliadau?

source: You want to appeal a benefits decision:
cy: Rydych eisiau apelio yn erbyn penderfyniad ynglŷn â budd-daliadau:

source: What is your problem about?
cy: Beth yw eich problem?

source: optional
cy: dewisol

source: Frequency
cy: Pa mor aml

source: Amount
cy: Swm

source: Select all that apply
cy: Dewiswch bob un a fyddai yn wir

source: For example, £32.18 per week
cy: Er enghraifft, £32.18 yr wythnos

source: Click to hide this page
cy: Cliciwch i guddio’r dudalen hon

source: Hide this page
cy: Cuddio’r dudalen hon

source: Hide page
cy: Cuddio’r dudalen

source: Leave site
cy: Gadael y wefan

source: Quick exit
cy: Gadael yn gyflym

source: Or press escape key to hide this page
cy: Neu pwyswch y fysell Esc

source: Or press Esc key
cy: Neu pwyswch y fysell Esc

source: Back
cy: Yn ôl

source: Very satisfied
cy: Bodlon iawn

source: Satisfied
cy: Bodlon

source: Neither satisfied or dissatisfied
cy: Ddim yn fodlon nac yn anfodlon

source: Dissatisfied
cy: Anfodlon

source: Very dissatisfied
cy: Anfodlon iawn

source: No, I filled in this form myself
cy: Na, llenwais y ffurflen hon fy hun

source: I had help filling in this form
cy: Cefais rhyw fath arall o help

source: Someone else filled in this form for me
cy: Mi wnaeth rhywun arall lenwi’r ffurflen hon ar fy rhan

source: I used an accessibility tool such as a screen reader
cy: Defnyddiais offer hygyrchedd megis darllenydd sgrîn

source: I don’t know how to answer a question
cy: Dydw i ddim yn gwybod sut i ateb cwestiwn

source: I don’t have the paperwork I need
cy: Does gen i ddim y gwaith papur rwyf ei angen

source: I’d prefer to speak to someone
cy: Byddai’n well gennyf siarad â rhywun

source: I have trouble using online services
cy: Rwy’n cael trafferth defnyddio gwasanaethau ar-lein

source: I don’t understand how this service can help me
cy: Dydw i ddim yn deall sut gall y gwasanaeth hwn fy helpu

source: My problem area isn’t covered
cy: Nid yw’n ymdrin â maes fy mhroblem

source: I’d prefer not to say
cy: Mae’n well gen i beidio â dweud

source: Another reason
cy: Rheswm arall

source: Did you have difficulty using this service? Tell us about the problem.
cy: A gawsoch unrhyw anhawster gyda’r gwasanaeth hwn?

source: Do you have any ideas for how it could be improved?
cy: A oes gennych unrhyw syniadau o ran sut i’w wella?

source: Did you have any help filling in this form?
cy: A gawsoch unrhyw help i lenwi’r ffurflen hon?

source: You can select more than one option
cy: Gallwch ddewis mwy nag un opsiwn

source: Please specify
cy: Manylwch

source: Tell us whether your partner is self-employed
cy: Dywedwch wrthym a yw eich partner yn hunangyflogedig

source: Tell us whether your partner is employed
cy: Dywedwch wrthym a yw eich partner yn gyflogedig

source: See below for examples of what valuable items to include
cy: Gweler isod am enghreifftiau o’r eitemau gwerthfawr i’w cynnwys

source: Something went wrong. Please try again.
cy: Mae rhywbeth wedi mynd o’i le. Rhowch gynnig arall arni.

source: Clinical negligence
cy: Esgeuluster clinigol

source: Doctors and nurses not treating you with due care during medical treatment
cy: Meddygon a nyrsys heb eich trin â gofal dyladwy yn ystod triniaeth feddygol

source: Community care
cy: Gofal cymunedol

source: You’re unhappy with the care being provided for yourself or a relative due to age, disability or special educational needs - for example, in a care home or your own home
cy: Nid ydych chi’n fodlon ar y gofal sy’n cael ei ddarparu i chi neu i berthynas oherwydd oed, anabledd neu anghenion addysgol arbennig - er enghraifft, mewn cartref gofal neu yn eich cartref eich hun

source: Debt
cy: Dyled

source: Bankruptcy, repossession, mortgage debt that is putting your home at risk
cy: Methdaliad, adfeddiannu’ch cartref, dyled morgais sy’n rhoi’ch cartref mewn perygl

source: Domestic abuse
cy: Cam-drin domestig

source: Abuse at home, child abuse, harassment by an ex-partner, forced marriage
cy: Cam-drin yn y cartref, cam-drin plant, aflonyddu gan gynbartner, priodas dan orfod

source: Discrimination
cy: Gwahaniaethu

source: Being treated unfairly because of your race, sex, sexual orientation
cy: Cael eich trin yn annheg oherwydd eich hil, rhyw, cyfeiriadedd rhywiol

source: Education
cy: Addysg

source: Special educational needs, problems with school places, exclusions, learning difficulties
cy: Anghenion addysgol arbennig, problemau â lleoedd mewn ysgolion, gwahardd o’r ysgol, anawsterau dysgu

source: Employment
cy: Cyflogaeth

source: Being treated unfairly at work, unfair dismissal, employment tribunals
cy: Cael eich trin yn annheg yn y gwaith, diswyddo annheg, tribiwnlysoedd cyflogaeth

source: Family
cy: Teulu

source: Divorce, separation, arrangements for your children, children being taken into care
cy: Ysgaru, gwahanu, trefniadau ar gyfer eich plant, plant yn cael eu cymryd i ofal

source: Housing
cy: Tai

source: Eviction, homelessness, losing your rented home, rent arrears, harassment by a landlord or neighbour, health and safety issues with your home
cy: Troi allan, digartrefedd, colli cartref wedi’i rentu, ôl-ddyledion rhent, aflonyddu gan landlord neu gymydog, materion iechyd a diogelwch sy’n ymwneud â’ch cartref.

source: Immigration and asylum
cy: Mewnfudo a lloches

source: Applying for asylum or permission to stay in the UK, including for victims of human trafficking
cy: Gwneud cais am loches neu ganiatâd i aros yn y DU, gan gynnwys dioddefwyr masnachu mewn pobl

source: Mental health
cy: Iechyd meddwl

source: Help with mental health and mental capacity legal issues
cy: Help gyda materion cyfreithiol sy’n ymwneud ag iechyd meddwl a galluedd meddyliol

source: Personal injury
cy: Anaf personol

source: An accident that was not your fault
cy: Damwain lle nad oeddech chi ar fai

source: Public law
cy: Cyfraith gyhoeddus

source: Taking legal action against a public body, like your local council
cy: Cymryd camau cyfreithiol yn erbyn corff cyhoeddus, fel y cyngor lleol

source: Trouble with the police
cy: Trafferth gyda’r heddlu ac awdurdodau cyhoeddus eraill

source: Being treated unlawfully by authorities who detain, imprison and prosecute (for example, the police), abuse in care cases
cy: Rydych wedi cael eich trin yn anghywir gan yr heddlu neu awdurdodau eraill sydd â’r pŵer i’ch cadw, eich carcharu neu’ch erlyn

source: Welfare benefits
cy: Budd-daliadau lles

source: Appealing a decision made by the social security tribunal about your benefits to the Upper Tribunal, Court of Appeal or Supreme Court
cy: Mynd ag apêl yn erbyn penderfyniad gan y tribiwnlys nawdd cymdeithasol ynghylch eich budd-daliadau i’r Uwch Dribiwnlys, y Llys Apêl neu’r Goruchaf Lys

source: Any other problem
cy: Unrhyw broblem arall

source: Eligible
cy: Cymwys

source: Face-to-face
cy: Wyneb yn wyneb

source: Confirmation
cy: Cadarnhad

source: Child Benefit
cy: Budd-dal Plant

source: Guarantee Credit
cy: Credyd Gwarant

source: Income Support
cy: Cymhorthdal Incwm

source: Income-based Jobseeker’s Allowance
cy: Lwfans Ceisio Gwaith yn seiliedig ar Incwm

source: Income-related Employment and Support Allowance
cy: Lwfans Cyflogaeth a Chymorth yn Seiliedig ar Incwm

source: Universal Credit
cy: Credyd Cynhwysol

source: Any other benefits
cy: Unrhyw fudd-daliadau eraill

source: -- Please select --
cy: -- Dewiswch --

source: per week
cy: yr wythnos

source: 4 weekly
cy: pob 4 wythnos

source: per month
cy: pob mis

source: per year
cy: y flwyddyn

source: each week
cy: yr wythnos

source: every 4 weeks
cy: pob 4 wythnos

source: each month
cy: pob mis

source: each year
cy: y flwyddyn

source: Armed Forces Independence payment
cy: Taliad Annibyniaeth y Lluoedd Arfog

source: Attendance Allowance
cy: Lwfans Gweini

source: Back to Work Bonus
cy: Bonws Dychwelyd i’r Gwaith

source: Care in the community Direct Payment
cy: Taliad Uniongyrchol am Ofal Cymunedol

source: Carers’ Allowance
cy: Lwfans Gofalwyr

source: Constant Attendance Allowance
cy: Lwfans Gweini Cyson

source: Council Tax Benefits
cy: Budd-daliadau’r Dreth Gyngor

source: Disability Living Allowance
cy: Lwfans Byw i’r Anabl

source: Exceptionally Severe Disablement Allowance
cy: Lwfans Anabledd Difrifol Eithriadol

source: Fostering Allowance
cy: Lwfans Maethu

source: Housing Benefit
cy: Budd-dal Tai

source: Independent Living Funds payment
cy: Taliad Cronfa Byw’n Annibynnol

source: Personal Independence Payments
cy: Taliadau Annibyniaeth Bersonol

source: Severe Disablement Allowance
cy: Lwfans Anabledd Difrifol

source: Social Fund Payments
cy: Taliadau’r Gronfa Gymdeithasol

source: Special Education Needs (SEN) direct payment
cy: Taliad uniongyrchol Anghenion Addysgol Arbennig (SEN)

source: War Pension
cy: Pensiwn Rhyfel

source: I’ll call CLA
cy: Mi wnâi ffonio’r CLA

source: Call me back
cy: Eich ffonio’n ôl

source: Call someone else instead of me
cy: Ffoniwch rywun arall yn fy lle

source: Location
cy: Lleoliad

source: Organisation
cy: Sefydliad

source: The information you’ve entered has not been stored on your computer or mobile device. If you are at risk of harm, you should delete your browser history.
cy: Nid yw’r wybodaeth a ddarparwyd gennych wedi cael ei chadw ar eich cyfrifiadur nac ar eich dyfais symudol. Os ydych mewn perygl o niwed, dylech ddileu hanes eich porwr

source: Yes
cy: Ie

source: No
cy: Na

source: Please choose Yes or No
cy: Dewisiwch Ydw neu Nac ydw

source: Enter 0 if this does not apply.
cy: Rhowch 0 os nad yw hyn yn berthnasol.

source: Not a valid amount
cy: Nid yw’n swm dilys

source: This amount must be more than £{:,.0f}
cy: Mae’n rhaid i’r swm hwn fod yn fwy na £{:.0f}

source: This amount must be less than £{:,.0f}
cy: Mae’n rhaid i’r swm hwn fod yn llai na £{:.0f}

source: You can only have 1 main Property
cy: Dim ond un prif Eiddo allwch chi ei gael

source: About you
cy: Amdanoch chi

source: Do you have a partner?
cy: Oes gennych chi bartner?

source: Your husband, wife, civil partner (unless you have permanently separated) or someone you live with as if you’re married
cy: Eich gŵr, gwraig, partner sifil (oni bai eich bod wedi gwahanu yn barhaol) neu rywun sy’n byw gyda chi fel pe baech chi wedi priodi

source: Tell us whether you have a partner
cy: Oes gennych chi bartner

source: Tell us whether you’re in dispute with your partner
cy: Ydych chi mewn anghydfod â’ch partner

source: Tell us whether you receive benefits
cy: Ydych chi’n derbyn budd-daliadau

source: Tell us whether you have any children aged 15 or under
cy: Oes gennych chi blant 15 oed neu hŷn

source: Tell us how many children you have aged 15 or under
cy: Faint o blant 15 oed neu hŷn sydd gennych chi

source: Tell us whether you have any dependants aged 16 or over
cy: Oes gennych chi ddibynyddion 16 oed neu hŷn

source: Tell us how many dependants you have aged 16 or over
cy: Faint o ddibynyddion 16 oed neu hŷn sydd gennych chi

source: Tell us if you or your partner are aged 60 or over
cy: Ydych chi neu eich partner yn 60 oed neu hŷn

source: Tell us if you own any properties
cy: Ydych chi’n berchen ar unrhyw eiddo

source: Tell us if you are employed
cy: Ydych chi mewn gwaith

source: Tell us if you are self-employed
cy: Ydych chi’n hunangyflogedig

source: Tell us whether you have savings or investments
cy: Oes gennych chi gynilion neu fuddsoddiadau

source: Tell us if you have any valuable items worth over £500 each
cy: Oes gennych chi eitemau gwerthfawr sydd werth dros £500 yr un

source: Select which benefits you receive
cy: Dewiswch pa fudd-daliadau rydych chi’n eu derbyn

source: Tell us whether you receive any other benefits
cy: Ydych chi’n derbyn unrhyw fudd-daliadau eraill

source: Tell us how much you receive in other benefits
cy: Faint rydych chi’n ei dderbyn mewn budd-daliadau eraill

source: Tell us how often you receive these other benefits
cy: Pa mor aml rydych chi’n derbyn y budd-daliadau eraill hyn

source: Enter your total savings, or 0 if you have none
cy: Rhowch gyfanswm eich cynilion, neu 0 os nad oes gennych rai

source: Enter your total investments, or 0 if you have none
cy: Rhowch gyfanswm eich buddsoddiadau, neu 0 os nad oes gennych rai

source: Enter the total of all valuable items over £500
cy: Rhowch gyfanswm yr holl eitemau gwerthfawr dros £500

source: Enter the total amount of maintenance you receive, or 0 if this doesn’t apply to you
cy: Rhowch gyfanswm yr arian cynhaliaeth rydych chi’n ei dderbyn, neu rhowch 0 os nad yw hyn yn berthnasol i chi

source: Tell us how often you receive maintenance
cy: Pa mor aml rydych chi’n derbyn arian cynhaliaeth

source: Tell us how much maintenance you receive
cy: Faint o arian cynhaliaeth rydych chi’n ei dderbyn

source: Enter the pension you receive, or 0 if this doesn’t apply to you
cy: Rhowch gyfanswm y pensiwn rydych chi’n ei dderbyn, neu rhowch 0 os nad yw hyn yn berthnasol i chi

source: Tell us how often you receive your pension
cy: Pa mor aml rydych chi’n derbyn eich pensiwn

source: Tell us how much pension you receive
cy: Faint o bensiwn rydych chi’n ei dderbyn

source: Enter the total amount of other income you receive, or 0 if this doesn’t apply to you
cy: Rhowch gyfanswm yr incwm arall rydych chi’n ei dderbyn, neu rhowch 0 os nad yw hyn yn berthnasol i chi

source: Tell us how often you receive this other income
cy: Pa mor aml rydych chi’n derbyn yr incwm arall hwn

source: Tell us how much other income you receive
cy: Faint o incwm arall rydych chi’n ei dderbyn

source: Tell us how much rent you pay
cy: Faint rydych chi’n ei dalu mewn rhent

source: Tell us how often you pay this rent
cy: Pa mor aml rydych chi’n talu’r rhent hwn

source: Tell us how much maintenance you pay
cy: Faint o arian cynhaliaeth rydych chi’n ei dalu

source: Tell us how often you pay this maintenance
cy: Pa mor aml rydych chi’n talu’r arian cynhaliaeth hwn

source: Tell us how much you pay towards Criminal Legal Aid
cy: Faint rydych chi’n ei dalu tuag at Gymorth Cyfreithiol Troseddol

source: Tell us whether this is your main home
cy: Ai hwn yw eich prif gartref

source: Tell us whether anyone else owns a share of this property
cy: Oes rhywun arall yn berchen ar gyfran o’r eiddo hwn

source: Tell us the approximate value of this property
cy: Faint yw gwerth yr eiddo hwn, yn fras

source: Tell us how much is left to pay on the mortgage
cy: Faint sy’n weddill i’w dalu ar y morgais

source: Enter your mortgage repayment for last month
cy: Rhowch eich taliad morgais ar gyfer y mis diwethaf

source: Tell us whether you rent out some of this property
cy: Ydych chi’n gosod rhan o’r eiddo hwn ar rent

source: Tell us whether this property is in dispute
cy: Ydy’r eiddo hwn yn rhan o anghydfod

source: Tell us how much rent you receive from this property
cy: Faint o rent rydych chi’n ei dderbyn ar gyfer yr eiddo hwn

source: Tell us how often you receive this rent
cy: Pa mor aml rydych chi’n derbyn y rhent hwn

source: Tell us how much rent you receive
cy: Faint o rent rydych chi’n ei dderbyn

# There is/are
source: Yes
cy: Oes

# There is/are not
source: No
cy: Nac oes

source: If Yes, are you in a dispute with your partner?
cy: Os ydych, ydych chi mewn anghydfod â’ch partner?

source: This means your partner is the opponent in the dispute you need help with, for example a dispute over money or property
cy: Mae hyn yn golygu mai eich partner yw’r gwrthwynebydd yn yr anghydfod y mae arnoch angen cymorth ar ei gyfer, er enghraifft anghydfod am arian neu eiddo

# I am
source: Yes
cy: Ydw

# I’m not
source: No
cy: Nac ydw

source: Do you receive any benefits (including Child Benefit)?
cy: Ydych chi’n cael unrhyw fudd-daliadau (gan gynnwys Budd-dal Plant)?

source: Being on some benefits can help you qualify for legal aid
cy: Os ydych chi’n cael rhai budd-daliadau, gall hynny eich helpu i gymhwyso ar gyfer cymorth cyfreithiol

source: Do you have any children aged 15 or under?
cy: Oes gennych chi blant sy’n 15 oed neu’n iau?

source: Don’t include any children who don’t live with you
cy: Peidiwch â chynnwys plant nad ydyn nhw’n byw gyda chi

source: If Yes, how many?
cy: Os oes, faint?

source: Number must be between 1 and 50
cy: Rhaid i’r rhif fod rhwng 1 a 50

source: Enter a number between 1 and 50
cy: Rhowch rif rhwng 1 a 50

source: Do you have any dependants aged 16 or over?
cy: Oes gennych chi unrhyw ddibynyddion sy’n 16 oed neu’n hŷn

source: People who you live with and support financially. This could be a young person for whom you get Child Benefit
cy: Pobl sy’n byw gyda chi ac sy’n cael cymorth ariannol gennych chi. Gallai fod yn berson ifanc yr ydych chi’n cael Budd-dal Plant ar ei gyfer

source: Do you have any savings or investments?
cy: Oes gennych chi unrhyw gynilion neu fuddsoddiadau?

source: Do you have any valuable items worth over £500 each?
cy: Oes gennych chi unrhyw eitemau gwerthfawr sy’n werth mwy na £500 yr un?

source: Do you own any property?
cy: Ydych chi’n berchen ar unrhyw eiddo?

source: For example, a house, static caravan or flat
cy: Er enghraifft, tŷ, fflat neu garafán sefydlog

source: Are you employed?
cy: Ydych chi’n gyflogedig?

source: This means working as an employee - you may be both employed and self-employed
cy: Mae hyn yn golygu gweithio fel cyflogai - gallech chi fod yn gyflogedig ac yn hunangyflogedig

source: Is your partner employed?
cy: Ydy’ch partner yn gyflogedig?

source: This means working as an employee - your partner may be both employed and self-employed
cy: Mae hyn yn golygu gweithio fel cyflogai - gallech chi fod yn gyflogedig ac yn hunangyflogedig

source: Are you self-employed?
cy: Ydych chi’n hunangyflogedig?

source: This means working for yourself - you may be both employed and self-employed
cy: Mae hyn yn golygu gweithio i chi’ch hun - gallech chi fod yn gyflogedig ac yn hunangyflogedig

source: Is your partner self-employed?
cy: Ydy’ch partner yn hunangyflogedig?

source: This means working for yourself - your partner may be both employed and self-employed
cy: Mae hyn yn golygu gweithio i chi’ch hun - gallech chi fod yn gyflogedig ac yn hunangyflogedig

source: Are you or your partner (if you have one) aged 60 or over?
cy: Ydych chi neu eich partner (os oes gennych bartner) yn 60 oed neu’n hŷn?

source: Which benefits do you and your partner receive?
cy: Pa fudd-daliadau ydych chi a’ch partner yn eu cael?

source: Which benefits do you receive?
cy: Pa fudd-daliadau ydych chi’n eu cael?

source: If yes, enter the total amount you get for all your children
cy: Os ydych, rhowch y cyfanswm rydych chi’n ei gael ar gyfer eich holl blant

source: You and your partner’s additional benefits
cy: Eich budd-daliadau ychwanegol chi a’ch partner

source: Your additional benefits
cy: Eich budd-daliadau ychwanegol

source: Do you get any of these benefits?
cy: Ydych chi yn cael unrhyw un o’r budd-daliadau hyn?

source: Do you or your partner get any of these benefits?
cy: Ydych chi neu’ch partner yn cael unrhyw un o’r budd-daliadau hyn?

source: These benefits don’t count as income. Please tick the ones you receive.
cy: Nid yw’r budd-daliadau hyn yn cael eu cyfrif yn incwm. Ticiwch y rhai yr ydych chi’n eu cael.

source: Do you receive any other benefits not listed above?
cy: Ydych chi yn cael unrhyw fudd-daliadau eraill sydd heb eu rhestru uchod?

source: Do you or your partner receive any other benefits not listed above?
cy: Ydych chi neu’ch partner yn cael unrhyw fudd-daliadau eraill sydd heb eu rhestru uchod?

source: For example, National Asylum Support Service Benefit, Incapacity Benefit, Contribution-based Jobseeker’s Allowance
cy: Er enghraifft, Budd-dal y Gwasanaeth Cynnal Cenedlaethol i Geiswyr Lloches, Budd-dal Analluogrwydd, Lwfans Ceisio Gwaith yn Seiliedig ar Gyfraniadau

source: If Yes, total amount of benefits not listed above
cy: Os ydych chi, cyfanswm y budd-daliadau sydd heb eu rhestru uchod

source: Is this property your main home?
cy: Ai’r eiddo hwn yw’ch prif gartref?

source: If you are separated and no longer live in the property you own, please answer ‘no’
cy: Os ydych chi wedi gwahanu ac os nad ydych chi bellach yn byw yn yr eiddo yr ydych chi’n berchen arno, rhowch ‘na’ yn ateb

source: Does anyone else own a share of the property?
cy: A oes unrhyw un arall sy’n berchen ar gyfran o’r eiddo?

source: Select ‘Yes’ if you share ownership with a friend, relative or ex-partner
cy: Rhowch ‘oes’ yn ateb os ydych chi’n rhannu perchenogaeth â ffrind, perthynas neu gynbartner

source: Does anyone else (other than you or your partner) own a share of the property?
cy: A oes unrhyw un arall (heblaw chi neu’ch partner) sy’n berchen ar gyfran o’r eiddo?

source: How much is the property worth?
cy: Beth yw gwerth yr eiddo?

source: Use a property website or the Land Registry house prices website.
cy: Defnyddiwch wefan eiddo neu wefan prisiau tai’r Gofrestrfa Tir

source: Please enter a valid amount
cy: Nodwch swm dilys

source: How much is left to pay on the mortgage?
cy: Pa swm sy’n weddill i’w dalu ar y morgais?
