Repository: ministryofjustice/cla_public
Catalog: cla_public/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: If you are worried about the cost, you can request a call-back within 24 hours by either calling the helpline or texting ‘legal aid’ and your name to <strong class="govuk-!-font-weight-bold">80010</strong>.
cy: Os ydych yn pryderu am y gost, gallwch wneud cais i aelod o staff eich ffonio yn ôl o fewn 24 awr, un ai trwy ffonio’r llinell gymorth neu drwy anfon neges destun gyda’r geiriau ‘legal aid’ a’ch enw i <strong class="govuk-!-font-weight-bold">80010</strong>.

source: Opening times:
cy: Oriau agor:

source: Monday to Friday: 9am to 8pm
cy: Dydd Llun i ddydd Gwener: 9am tan 8pm

source: Monday to Friday: 9am to 5pm
cy: Dydd Llun i ddydd Gwener: 9am tan 5pm

source: Saturday: 9am to 12.30pm
cy: Dydd Sadwrn: 9am tan 12.30pm

source: There is a problem
cy: Mae yna broblem

source: If you’re having trouble completing this form
cy: Os ydych yn cael problemau wrth lenwi’r ffurflen hon, gofynnwch i ni

source: get in touch
cy: cysylltwch â ni

source: What do you think about this service?
cy: A gawsoch unrhyw anhawster gyda’r gwasanaeth hwn?

source: Your feedback will improve this service. Please <a class="govuk-link" href="https://www.gov.uk/done/check-if-civil-legal-advice-can-help-you">send us your thoughts</a>.
cy: Bydd eich adborth yn gwella’r gwasanaeth hwn. <a class="govuk-link" href="https://www.gov.uk/done/check-if-civil-legal-advice-can-help-you">Anfonwch eich sylwadau atom</a>.

source: The information you enter won’t be stored on this device. Find out more about %(link)s.
cy: Ni fydd yr wybodaeth a ddarparwyd gennych yn cael ei chadw ar y dyfais hwn. I gael rhagor o wybodaeth am %(link)s.

source: Opens in new window
cy: Agor mewn ffenestr newydd

source: Help organisations for problems about %(category_name)s
cy: Sefydliadau cymorth ar gyfer problemau ynghylch %(category_name)s

source: You may still get help and advice from the organisations listed below. You don’t have to qualify for legal aid.
cy: Efallai y byddwch chi’n dal yn gallu cael help a chyngor gan y sefydliadau sydd wedi’u rhestru isod. Nid oes rhaid i chi fod yn gymwys i gael cymorth cyfreithiol.

source: There has been a problem with listing help organisations. Please refresh this page or try again later.
cy: Cafwyd problem gyda rhestru sefydliadau cymorth. Adnewyddwch y dudalen neu rhowch gynnig arall yn nes ymlaen

source: Opening hours
cy: Oriau agor

source: We will call at least once during your chosen time, or as close to the time as possible.
cy: Byddwn yn ceisio ffonio o leiaf unwaith yn ystod yr amser a ddewiswyd gennych, neu mor agos at yr amser â phosibl.

source: If you miss the call you’ll need to complete this form again.
cy: Os byddwch yn methu’r alwad, bydd arnoch angen llenwi’r ffurflen hon eto.

source: Please make sure you are with your nominated person at the time of the callback.
cy: Gwnewch yn siŵr eich bod gyda’r unigolyn a enwebwyd gennych ar yr amser y byddwn yn ffonio’n ôl.

source: If your nominated person misses the call you’ll need to complete this form again.
cy: Os yw’r unigolyn a enwebwyd yn methu’r alwad, bydd arnoch angen llenwi’r ffurflen hon eto.

source: Choose the area you most need help with
cy: Dewiswch y maes y mae arnoch angen mwyaf o gymorth gydag ef

source: Select which area you most need help with
cy: Dewiswch y maes y mae arnoch angen mwyaf o gymorth gydag ef

source: Your answers
cy: Eich atebion

source: Question
cy: Cwestiwn

source: Answer
cy: Ateb

source: (current)
cy: (cyfredol)

source: Legal aid doesn’t cover all types of problem
cy: Nid yw cymorth cyfreithiol yn gallu delio â phob math o broblem

source: Exceptional cases
cy: Achosion eithriadol

source: In exceptional cases or if your case is going to a judicial review, legal aid may still be available.
cy: Mewn achosion arbennig, nes os bydd eich achos yn destun adolygiad barnwrol, gall cyngor cyfreithiol dal fod ar gael.

source: In exceptional cases, legal aid may still be available.
cy: Gall cymorth cyfreithiol dal fod ar gael mewn achosion eithriadol.

source: You can %(ask_legal_adviser_link)s if an application might succeed in your case and how to apply.
cy: Gallwch ofyn am gyngor gan gynghorydd cyfreithiol ynghylch a fydd cais am gymorth cyfreithiol yn debygol o lwyddo yn eich achos chi a sut i wneud cais.

source: You can also %(apply_directly_link)s to the Legal Aid Agency.
cy: Gallwch hefyd gyflwyno cais yn uniongyrchol i’r Asiantaeth Cymorth Cyfreithiol.

source: You can still ask a solicitor for help – you will have to pay for their advice.
cy: Gallwch dal ofyn i gyfreithiwr eich helpu - bydd rhaid ichi dalu am eu cyngor.

source: From what you’ve told us today, it looks as though your problem is not covered.
cy: O’r hyn rydych wedi dweud wrthym heddiw, mae’n ymddangos nad yw eich problem chi yn gymwys.

source: You can still ask a solicitor for help - you will have to pay for their advice.
cy: Gallwch dal ofyn i gyfreithiwr eich helpu - bydd rhaid ichi dalu am eu cyngor.

source: You may still get help and advice from the organisations listed below. You don’t have to qualify for legal aid.
cy: Er hynny, efallai y byddwch yn gallu cael help a chyngor gan y sefydliadau sydd wedi’u rhestru isod. Nid oes rhaid ichi fod yn gymwys i gael cymorth cyfreithiol.

source: You may be able to get legal aid for family mediation
cy: Mae’n bosibl y byddwch yn gallu cael cymorth cyfreithiol ar gyfer cyfryngu mewn achos teulu

source: Search for a family mediator in your area to find out if you qualify.
cy: Chwiliwch am gyfryngwr teulu yn eich ardal chi i ganfod a ydych yn gymwys ai peidio.

source: Find your local mediator
cy: Dewch o hyd i’ch cyfryngwr lleol

source: Accessibility statement
cy: Datganiad hygyrchedd

source: Using this service
cy: Defnyddio’r gwasanaeth hwn

source: The Legal Aid Agency (<abbr>LAA</abbr>) is responsible for the Civil Legal Advice (<abbr>CLA</abbr>) service.
cy: Yr Asiantaeth Cymorth Cyfreithiol (<abbr>LAA</abbr>) sy’n gyfrifol am y gwasanaeth Cyngor Cyfreithiol Sifil (<abbr>CLA</abbr>).

source: We want as many people as possible to be able to use this service. For example, that means you should be able to:
cy: Rydyn ni am i gynifer o bobl â phosibl allu defnyddio’r gwasanaeth hwn. Er enghraifft, mae hynny’n golygu y dylech allu:

source: change colours, contrast levels and fonts
cy: newid lliwiau, lefelau cyferbyniad a ffontiau

source: zoom in up to 300&#37; without the text spilling off the screen
cy: chwyddo mewn hyd at 300&#37; heb i’r testun ollwng oddi ar y sgrin

source: navigate the service using just a keyboard
cy: symud o gwmpas gan ddefnyddio bysellfwrdd yn unig

source: AbilityNet has advice on making your device easier to use if you have a disability.
cy: Mae gan AbilityNet gyngor ar wneud eich dyfais yn haws ei defnyddio os oes gennych chi anabledd.

source: What to do if you can’t access part of this service
cy: Beth i’w wneud os na allwch gael mynediad at ran o’r gwasanaeth hwn

source: If you need information on this service in a different format, you can contact us at %(email)s.
cy: Os oes angen gwybodaeth arnoch am y gwasanaeth hwn mewn fformat gwahanol, gallwch gysylltu â ni yn %(email)s.

source: Reporting accessibility problems
cy: Rhoi gwybod am broblemau hygyrchedd

source: We’re always looking to improve the accessibility of this service. If you find any problems that aren’t listed on this page or think we’re not meeting the requirements of the accessibility regulations, contact %(email)s giving details of the issue and any assistive technology you are using.
cy: Rydyn ni bob amser yn ceisio gwella hygyrchedd y gwasanaeth hwn. Os byddwch chi’n dod o hyd i unrhyw broblemau nad ydynt wedi’u rhestru ar y dudalen hon neu os ydych chi’n meddwl nad ydyn ni’n bodloni gofynion y rheoliadau hygyrchedd, cysylltwch â %(email)s gan roi manylion y broblem ac unrhyw dechnoleg gynorthwyol rydych chi’n ei defnyddio.

source: Enforcement procedure
cy: Gweithdrefn gorfodi

source: The Equality and Human Rights Commission (<abbr>EHRC</abbr>) is responsible for enforcing the accessibility regulations. If you’re not happy with how we respond to your complaint, contact the <a class="govuk-link" href="https://www.equalityadvisoryservice.com/" rel="external">Equality Advisory and Support Service (<abbr>EASS</abbr>)</a>.
cy: Y Comisiwn Cydraddoldeb a Hawliau Dynol sy’n gyfrifol am orfodi’r rheoliadau hygyrchedd. Os nad ydych chi’n fodlon â sut rydyn ni’n ymateb i’ch cwyn, cysylltwch â’r <a class="govuk-link" href="http://eass-ws.custhelp.com/app/home" rel="external">Gwasanaeth Cynghori a Chefnogi Cydraddoldeb (<abbr>EASS</abbr>)</a>.

source: Technical information about this service’s accessibility
cy: Gwybodaeth dechnegol am hygyrchedd y gwasanaeth hwn

source: The Legal Aid Agency is committed to making its service accessible, in accordance with the Public Sector Bodies (Websites and Mobile Applications) (&#8470; 2) Accessibility Regulations 2018.
cy: Mae’r Asiantaeth Cymorth Cyfreithiol wedi ymrwymo i wneud ei gwasanaeth yn hygyrch, yn unol â Rheoliadau Hygyrchedd Cyrff Sector Cyhoeddus (Gwefannau a Rhaglenni Symudol) (Rhif 2) 2018.

source: Web Content Accessibility Guidelines version 2.1
cy: Canllawiau Hygyrchedd Cynnwys y We fersiwn 2.1

source: This service is partially compliant with the %(wcaglink)s AA standard, due to the non-compliance issues listed below.
cy: Mae’r gwasanaeth hwn yn cydymffurfio’n rhannol â safon AA %(wcaglink)s, oherwydd y materion diffyg cydymffurfio a restrir isod.

source: Non-accessible content
cy: Cynnwys nad oes modd cael gafael arno

source: The content listed below is non-accessible for the following reasons.
cy: Nid oes modd cael gafael ar y cynnwys a restrir isod am y rhesymau canlynol.

source: Non-compliance with the accessibility regulations
cy: Ddim yn cydymffurfio â’r rheoliadau hygyrchedd

source: Users are not able to turn off, adjust or extend the time in which inactivity will result in a loss of data. This fails WCAG 2.1 2.2.1 A (Timing Adjustable).
cy: Ni all defnyddwyr ddiffodd, addasu nac ymestyn yr amser pan fydd anweithgarwch yn arwain at golli data. Mae hyn yn methu WCAG 2.1 2.2.1 A (Addasu’r Amseriad).

source: Some page elements are not available in Welsh. This fails WCAG 2.1 3.1.1 A (Language of Page).
cy: Nid yw rhai elfennau tudalen ar gael yn Gymraeg. Mae hyn yn methu WCAG 2.1 3.1.1 A (Iaith Tudalen).

source: When a user enters figures into form fields it is not clear that the field does not accept currency symbols. This fails WCAG 2.1 2.4.6 AA (Headings and Labels).
cy: Pan fydd defnyddiwr yn rhoi ffigurau mewn meysydd ffurflen, nid yw’n glir nad yw’r maes yn derbyn symbolau arian. Mae hyn yn methu WCAG 2.1 2.4.6 AA (Penawdau a Labeli).

source: Disproportionate burden
cy: Baich anghymesur

source: Not applicable
cy: Ddim yn berthnasol

source: Content that’s not within the scope of the accessibility regulations
cy: Cynnwys nad yw o fewn cwmpas y rheoliadau hygyrchedd

source: How we tested this service
cy: Sut y buom yn profi’r gwasanaeth hwn

source: July
cy: Gorffennaf

source: September
cy: Medi

source: December
cy: Rhagfyr

source: This service was last tested on %(day)s %(month)s %(year)s.
cy: Cafodd y gwasanaeth hwn ei brofi ddiwethaf ar %(day)s %(month)s %(year)s.

source: The test was carried out by the Digital Accessibility Centre (<abbr>DAC</abbr>).
cy: Cynhaliwyd y prawf gan y Ganolfan Hygyrchedd Digidol (<abbr>DAC</abbr>).

source: The <abbr title='Digital Accessibility Centre'>DAC</abbr> tested the service available at <a class='govuk-link' href='https://checklegalaid.service.gov.uk/'>https://checklegalaid.service.gov.uk/</a>.
cy: Profodd y <abbr title='Ganolfan Hygyrchedd Digidol'>DAC</abbr> y gwasanaeth sydd ar gael yn <a class='govuk-link' href='https://www.gov.uk/gwirio-os-ydych-yn-gymwys-i-gael-cymorth-cyfreithiol'>https://checklegalaid.service.gov.uk/</a>.

source: What we’re doing to improve accessibility
cy: Beth rydyn ni’n ei wneud i wella hygyrchedd

source: We are working to fix the issues listed in this statement by %(month)s %(year)s. When the issues are fixed we will send the service for a re-test with the <abbr title='Digital Accessibility Centre'>DAC</abbr>.
cy: Rydyn ni’n gweithio i ddatrys y materion a restrir yn y datganiad hwn erbyn mis %(month)s %(year)s. Pan fydd y materion yn cael eu datrys, byddwn yn anfon y gwasanaeth i gael ail brawf gyda’r <abbr title='Ganolfan Hygyrchedd Digidol'>DAC</abbr>.

source: We will monitor the accessibility of this service on an ongoing basis and fix any accessibility issues reported to us.
cy: Byddwn yn monitro hygyrchedd y gwasanaeth hwn yn barhaus ac yn datrys unrhyw broblemau hygyrchedd y rhoddir gwybod i ni amdanyn nhw.

source: 24/7, every day of the year, including Christmas
cy: 24 awr y dydd, 7 diwrnod yr wythnos

source: 24 hours a day, 365 days a year
cy: 24 awr y dydd, 7 diwrnod yr wythnos

source: 9am - 5pm
cy: 9yb &ndash; 5yp

source: 8am to 7pm, every day of the year
cy: Dydd Llun i ddydd Sul, 8yb &ndash; 7yh

source: Every day of the year 12:00 -14:30 and 19:00 - 21:30
cy: Dydd Llun i ddydd Sul, 12:00yp &ndash; 2:30yp a 7:00yh &ndash; 9:30yh

source: 7 days a week, 7 am - midnight
cy: Dydd Llun i ddydd Sul, 7:00yb &ndash; hanner nos

source: Wednesday to Thursday 10am - 8pm
cy: Dydd Mercher a Iau, 10yb &ndash; 8yh

source: Only Monday 10am - 2pm
cy: Dydd Llun, 10yb &ndash; 2yp

source: Friday 10am - 1pm
cy: Dydd Gwener, 10yb &ndash; 1yp

source: Monday to Friday, 9.15am - 5.15pm
cy: Dydd Llun i ddydd Gwener, 9:15yb &ndash; 5:15yp

source: Monday-Friday, 9.30am - 5.30pm
cy: Dydd Llun i ddydd Gwener, 9:30yb &ndash; 5:30yp

source: Monday - Friday, 8am - 6pm
cy: Dydd Llun i ddydd Gwener, 8yb &ndash; 6yh

source: Monday to Friday 8am - 6pm
cy: Dydd Llun i ddydd Gwener, 8yb &ndash; 6yh

source: Monday - Friday, 8.30am - 5:30pm,
cy: Dydd Llun i ddydd Gwener, 8:30yb &ndash; 5:30yp

source: Monday to Friday 9:30am–5:30pm
cy: Dydd Llun i ddydd Gwener, 9:30yb &ndash; 5:30yp

source: Monday to Friday 9:30am - 4:30pm
cy: Dydd Llun i ddydd Gwener, 9:30yb &ndash; 4:30yp

source: Monday - Friday, 9am - 5pm.
cy: Dydd Llun i ddydd Gwener, 9yb &ndash; 5yp

source: Monday to Friday 09:00am to 5pm
cy: Dydd Llun i ddydd Gwener, 9yb &ndash; 5yp

source: Monday - Friday 9am-5pm
cy: Dydd Llun i ddydd Gwener, 9yb &ndash; 5yp

source: Monday-Friday, 9am-5pm
cy: Dydd Llun i ddydd Gwener, 9yb &ndash; 5yp

source: Monday to Friday 9am - 5pm
cy: Dydd Llun i ddydd Gwener, 9yb &ndash; 5yp

source: Monday to Friday, 9am - 5pm
cy: Dydd Llun i ddydd Gwener, 9yb &ndash; 5yp

source: Monday - Friday, 9am - 5pm
cy: Dydd Llun i ddydd Gwener, 9yb &ndash; 5yp

source: Monday -Friday, 9.00am - 5.00pm
cy: Dydd Llun i ddydd Gwener, 9yb &ndash; 5yp

source: Mondays to Fridays 9 am - 5.30 pm
cy: Dydd Llun i ddydd Gwener, 9yb &ndash; 5:30yp

source: Monday - Friday, 9.30am-3pm
cy: Dydd Llun i ddydd Gwener, 9:30yb &ndash; 3yp

source: Monday - Friday, 10am-5pm
cy: Dydd Llun i ddydd Gwener, 10yb &ndash; 5yp

source: Mon - Fri 09:00-17:00 (excl.bank holidays)
cy: Dydd Llun i ddydd Gwener, 9yb &ndash; 5yp (ac eithrio gwyliau banc)

source: Monday to Friday 9:30am to 4pm
cy: Dydd Llun i ddydd Gwener, 9:30yb &ndash; 4yp

source: Monday to Friday, 9.30am - 5.00pm
cy: Dydd Llun i ddydd Gwener, 9:30yb &ndash; 5yp

source: Monday to Friday 9am - 6pm
cy: Dydd Llun i ddydd Gwener, 9yb &ndash; 6yh

source: Monday to Friday, 9am - 7pm
cy: Dydd Llun i ddydd Gwener, 9yb &ndash; 7yh

source: Monday to Friday 9am - 8pm
cy: Dydd Llun i ddydd Gwener, 9yb &ndash; 8yh

source: Monday-Friday, 8am-8pm
cy: Dydd Llun i ddydd Gwener, 8yb &ndash; 8yh

source: Monday to Friday, 9:00am – 5:00pm, Closed for Lunch 12:30pm – 1:30pm
cy: Dydd Llun i ddydd Gwener, 9:00yb &ndash; 12:30yp a 1:30yp &ndash; 5:00yp

source: Monday to Friday 10am - 1pm then 2pm - 5pm
cy: Dydd Llun i ddydd Gwener, 10yb &ndash; 1yp a 2yp &ndash; 5yp

source: Monday to Friday, 8am - 8pm
cy: Dydd Llun i ddydd Gwener, 8yb &ndash; 8yh

source: Monday - Friday, 10am - 5pm (not Wednesdays)
cy: Dydd Llun/Mawrth/Iau/Gwener, 10yb &ndash; 5yp

source: Monday, Tuesday, Thursday, Friday 9am - 5pm Wednesday 10am - 5pm
cy: Dydd Llun/Mawrth/Iau/Gwener, 9yb &ndash; 5yp<br />Dydd Mercher, 10yb &ndash; 5yp

source: Monday to Thursday 10am-4pm, Friday 9am-3pm
cy: Dydd Llun i ddydd Iau, 10yb &ndash; 4yp;<br />Dydd Gwener, 9yb &ndash; 3yp

source: Monday, Wednesday and Friday 10:00-12:30 and 14:00-16:30, Tuesday Evening 16.30-19.00
cy: Dydd Llun/Mercher/Gwener, 10yb &ndash; 12:30yp; a 2:00yp &ndash; 4:30 yp<br />Dydd Mawrth, 4:30yp &ndash; 7:00yh

source: Monday and Wednesday 9am - 8pm, Tuesday, Thursday and Friday 9am - 5pm
cy: Dydd Llun/Mercher, 9yb &ndash; 8yh<br />Dydd Mawrth/Iau, 9yb &ndash; 5yp

source: Monday to Friday 8am to 8pm, Saturday 9am to 4pm
cy: Dydd Llun i ddydd Gwener, 8yb &ndash; 8yh;<br />Dydd Sadwrn, 9yb &ndash; 4yp

source: Monday-Friday, 9am-9pm, Saturday-Sunday, 10am-3pm
cy: Dydd Llun i ddydd Gwener, 9yb &ndash; 9yh;<br />Dydd Sadwrn a Sul, 10yb &ndash; 3yp

source: Monday to Friday 8:30am - 6:30pm, Saturdays 9am - 1pm
cy: Dydd Llun i ddydd Gwener, 8:30yb &ndash; 6:30yh;<br />Dydd Sadwrn, 9yb &ndash; 1yp

source: Monday - Friday 9am - 10pm, Saturday and Sunday 10am - 3pm
cy: Dydd Llun i ddydd Gwener, 9yb &ndash; 10yh;<br />Dydd Sadwrn a Sul, 10yb &ndash; 3yp

source: Monday to Friday 8am - 8pm, Saturday and Sunday 9am - 5pm
cy: Dydd Llun i ddydd Gwener, 8yb &ndash; 8yh;<br />Dydd Sadwrn a Sul, 9yb &ndash; 5yp

source: Monday-Friday, 8am-8pm Saturday-Sunday, 8am-5pm
cy: Dydd Llun i ddydd Gwener, 8yb &ndash; 8yh;<br />Dydd Sadwrn a Sul, 9yb &ndash; 5yp

source: Monday - Friday, 8am - 8pm Saturday, 9am - 4pm
cy: Dydd Llun i ddydd Gwener, 8yb &ndash; 8yh;<br />Dydd Sadwrn, 9yb &ndash; 4yp

source: Monday to Friday 8am - 8pm, Saturday 8am - 4pm
cy: Dydd Llun i ddydd Gwener, 8yb &ndash; 8yh;<br />Dydd Sadwrn, 8yb &ndash; 4yp

source: Monday to Friday 9am - 7pm, Saturday 10am to 2pm.
cy: Dydd Llun i ddydd Gwener, 9yb &ndash; 7yh;<br />Dydd Sadwrn, 10yb &ndash; 2yp

source: Monday - Friday, 9am - 8pm Saturday, 10am - 2pm
cy: Dydd Llun i ddydd Gwener, 9yb &ndash; 8yh;<br />Dydd Sadwrn, 10yb &ndash; 2yp

source: Monday to Friday 9am-9pm, Saturday 9.30am-1pm
cy: Dydd Llun i ddydd Gwener, 9yb &ndash; 9yh;<br />Dydd Sadwrn, 9:30yb &ndash; 1yp

source: Monday-Friday, 8am-8pm Saturday, 9am-1pm
cy: Dydd Llun i ddydd Gwener, 8yb &ndash; 8yh;<br />Dydd Sadwrn, 9yb &ndash; 1yp

source: Monday - Friday, 8am - 8pm Saturday, 9am - 1pm
cy: Dydd Llun i ddydd Gwener, 8yb &ndash; 8yh;<br />Dydd Sadwrn, 9yb &ndash; 1yp

source: Monday - Friday, 8am-8pm Saturday, 9am-12pm
cy: Dydd Llun i ddydd Gwener, 8yb &ndash; 8yh;<br />Dydd Sadwrn, 9yb &ndash; 12yp

source: Monday - Friday, 9am-9pm Saturday, 9.30am-1pm
cy: Dydd Llun i ddydd Gwener, 9yb &ndash; 9yh;<br />Dydd Sadwrn, 9:30yb &ndash; 1yp

source: Monday to Friday 8am - 8pm, Saturday to Sunday 10am - 6pm
cy: Dydd Llun i ddydd Gwener, 8yb &ndash; 8yh;<br />Dydd Sadwrn a Sul, 10yb &ndash; 6yh

source: Mondays, 10am - 6pm Tuesdays/Thursdays/Fridays, 10am - 4pm Wednesdays, 10am-1pm and 5pm-7pm
cy: Dydd Llun, 10yb &ndash; 6yh;<br />Dydd Mawrth/Iau/Gwener, 10yb &ndash; 4yp;<br />Dydd Mercher, 10yb &ndash; 1yp a 5yp &ndash; 7yh

source: Monday, 10am-8pm Tuesday, 10am-5pm , (1pm-5pm Tuesday is a trans-specific service) Wednesday, 10am-5pm Thursday, 10am - 8pm
cy: Dydd Llun, 10yb &ndash; 8yh;<br />Dydd Mawrth, 10yb &ndash; 5yp;<br />Dydd Mercher, 10yb &ndash; 5yp;<br />Dydd Iau, 10yb &ndash; 8yh

source: What payments do not count as savings?
cy: Pa daliadau nad ydynt yn cyfrif fel cynilion?

source: What payments do not count as income?
cy: Pa daliadau nad ydynt yn cyfrif fel incwm?

source: Do not include monies received from the following schemes
cy: Peidiwch â chynnwys arian a geir o'r cynlluniau canlynol

source: National Emergencies Trust
cy: Ymddiriedolaeth Argyfyngau Cenedlaethol

source: We Love Manchester Emergency Fund
cy: Cronfa Argyfwng We Love Manchester

source: This accessibility statement applies to https://checklegalaid.service.gov.uk/. The Legal Aid Agency (LAA) is responsible for the Civil Legal Advice (CLA) service.
cy: Mae'r datganiad hygyrchedd hwn yn ymwneud â https://checklegalaid.service.gov.uk/. Yr Asiantaeth Cymorth Cyfreithiol (LAA) sy’n gyfrifol am y gwasanaeth Cyngor Cyfreithiol Sifil (CLA).

source: Feedback and contact information
cy: Adborth a gwybodaeth gyswllt

source: Compliance status
cy: Statws cydymffurfio

source: Time-out
cy: Terfyn amser

source: We are experiencing intermittent problems with the time-out feature where users are unexpectedly timed-out without the time-out warning appearing. We are currently investigating the source of this issue.
cy: Rydym yn cael problemau ysbeidiol gyda'r nodwedd terfyn amser, lle bydd amser defnyddwyr yn dod i ben yn annisgwyl heb i'r rhybudd terfyn amser ymddangos. Rydym yn ymchwilio i'r broblem hon ar hyn o bryd.

source: The ‘Hide this page’ button does not accurately describe the link destination. This fails WCAG 2.1 1.3.1 A (Info and relationships) and 2.4.6 AA (Headings and Labels).
cy: Nid yw'r botwm ‘Cuddio'r dudalen hon’ yn disgrifio cyrchfan y ddolen yn gywir. Mae hyn yn methu WCAG 2.1 1.3.1 A (Gwybodaeth a pherthnasoedd) a 2.4.6 AA (Penawdau a Labeli).

source: We understand that ‘Hide this page’ does not describe the link destination. We have purposely designed the feature to protect vulnerable users and provide a quick exit from the service rather than take users to a specific destination.
cy: Rydym yn deall nad yw ‘Cuddio'r dudalen hon’ yn disgrifio cyrchfan y ddolen. Rydym wedi dylunio'r nodwedd yn fwriadol i ddiogelu defnyddwyr agored i niwed, a'u galluogi i adael y gwasanaeth yn gyflym yn hytrach nag arwain defnyddwyr i gyrchfan penodol.

source: We are working to fix the time-out issue listed in this statement.
cy: Rydym yn gweithio i ddatrys y broblem terfyn amser a restrir yn y datganiad hwn.

source: Preparation of this accessibility statement
cy: Paratoi'r datganiad hygyrchedd hwn

source: This statement was prepared on 17 September 2020. It was last reviewed on 30 November 2020.
cy: Paratowyd y datganiad hwn ar 17 Medi 2020. Fe’i adolygwyd ddiwethaf ar 30 Tachwedd 2020.

source: This service was tested on 22 July 2020 and issues were re-tested on 23 October 2020. The tests were carried out by the Digital Accessibility Centre (DAC).
cy: Profwyd y gwasanaeth hwn ar 22 Gorffennaf 2020 ac ailbrofwyd y materion a oedd angen sylw ar 23 Hydref 2020. Cynhaliwyd y profion gan y Ganolfan Hygyrchedd Digidol (DAC).

source: The DAC tested core journeys, key functionality and interactive features that reflect the content that the average user may encounter.
cy: Aeth y DAC ati i brofi teithiau craidd, swyddogaeth allweddol a nodweddion rhyngweithiol sy'n adlewyrchu'r cynnwys y gall y defnyddiwr cyffredin ddod ar eu traws.

source: The DAC tested the service available at https://checklegalaid.service.gov.uk/.
cy: Mae'r DAC wedi profi'r gwasanaeth sydd ar gael yn https://checklegalaid.service.gov.uk/.
