Repository: ministryofjustice/cla_public
Catalog: cla_public/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: <abbr>CLA</abbr> will accept contact made by a third-party on behalf of another person. The third party has to demonstrate they have appropriate authority to act on your behalf. <br><br> <abbr>CLA</abbr> must record the relationship between the third-party and the individual seeking advice and whether they are authorised to act on their behalf. <br><br> They must also agree a password to verify the identity of the third-party if they contact the service again.
cy: Bydd <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yn cydnabod trydydd parti sy’n cysylltu ar ran person arall. Mae’n rhaid i’r trydydd parti ddangos bod ganddynt yr awdurdod priodol i weithredu ar eich rhan. Rhaid i <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> gofnodi’r berthynas rhwng y trydydd parti a’r unigolyn sy’n gofyn am gyngor ac a yw’r trydydd parti wedi’i awdurdodi i weithredu ar ei ran. Hefyd rhaid i <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> gytuno ar gyfrinair er mwyn gwirio hunaniaeth y trydydd parti os bydd yn cysylltu â’r gwasanaeth eto.

source: Outgoing Communications
cy: Anfon negeseuon allan

source: <abbr>CLA</abbr> may need to contact you directly.
cy: Mae’n bosibl y bydd angen i <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> gysylltu â chi’n uniongyrchol.

source: In order to protect privacy, <abbr>CLA</abbr> will always check with you what forms of outgoing communication are acceptable and appropriate and whether messages can be left.
cy: Er mwyn sicrhau preifatrwydd, bydd <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> bob amser yn gofyn pa ddulliau cyfathrebu sy’n dderbyniol ac yn briodol i chi ac a oes modd gadael negeseuon.

source: When making outgoing calls to you, <abbr>CLA</abbr> will ensure that:
cy: Pan fydd <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yn eich ffonio chi, bydd yn:

source: Call backs are only made where you have agreed to this. Authorised third parties acting on your behalf can give agreement.
cy: Mai dim ond os ydych chi wedi cytuno ar hynny y byddwn ni’n ffonio’n ôl. Gall trydydd parti gytuno ar hyn os yw wedi’i awdurdodi i weithredu ar eich rhan.

source: Where a call back is made to you and there is no answer and a message taker is available, no message will be left unless you have previously given specific instructions that this would be acceptable.
cy: Os yw’n ffonio’n ôl ac nad oes ateb, a bod recordydd negeseuon ar gael, na fydd yn gadael neges oni bai eich bod wedi rhoi cyfarwyddiadau penodol cyn hynny fod hyn yn dderbyniol.

source: Where the phone is answered and someone other than you answers the phone and says that you are unavailable or asks who is calling, <abbr>CLA</abbr> will state that the call is confidential and will not say that they are calling from <abbr>CLA</abbr>.
cy: Os bydd rhywun heblaw chi’n ateb y ffôn ac yn dweud nad ydych chi ar gael neu’n gofyn pwy sy’n galw, y bydd <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yn dweud bod yr alwad yn gyfrinachol ac na fydd yn dweud ei fod yn ffonio o <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr>.

source: How we use cookies
cy: Sut yr ydym yn defnyddio cwcis

source: When you use our online services we may store a small file, known as a cookie, on your <abbr title="Personal Computer">PC</abbr> or digital device.
cy: Pan fyddwch chi’n defnyddio ein gwasanaethau ar-lein, mae’n bosibl y byddwn ni’n storio ffeil fach, sy’n cael ei galw’n ‘cwci’, ar eich cyfrifiadur personol neu ddyfais ddigidol.

source: You may see a message before we store a cookie on your computer.
cy: Mae’n bosibl y byddwch chi’n gweld neges cyn i ni storio cwci ar eich cyfrifiadur.

source: The cookies are not used to identify you personally.
cy: Nid yw’r cwcis yn cael eu defnyddio i’ch adnabod yn bersonol..

source: We use these cookies to:
cy: Rydyn ni’n defnyddio’r cwcis hyn er mwyn:

source: Help your <abbr>PC</abbr> or digital device to interact with us more quickly
cy: Helpu’ch cyfrifiadur personol neu ddyfais ddigidol i ryngweithio â ni’n fwy cyflym

source: Measure how you use our service so it can be updated and improved based on your needs
cy: Asesu sut yr ydych chi’n defnyddio ein gwasanaeth er mwyn ei ddiweddaru a’i wella ar sail eich anghenion

source: Remember the notifications you’ve seen so that we don’t show them to you again
cy: Cofio’r negeseuon yr ydych chi wedi’u gweld fel na fyddwn ni’n eu dangos i chi eto

source: Remember how you progress through our service. These cookies don’t store your personal data and are deleted once you’ve completed the service.
cy: Cofio’r camau yr ydych chi’n eu cymryd drwy ein gwasanaeth. Nid yw’r cwcis hyn yn storio’ch data personol a byddan nhw’n cael eu dileu ar ôl i chi orffen defnyddio’r gwasanaeth.

source: Protect your security by ensuring that third parties cannot create sites that pose as a gov.uk service in an attempt to gather your information
cy: Gwarchod eich diogelwch drwy sicrhau na all trydydd partïon greu safleoedd sy’n cymryd arnynt eu bod yn un o wasanaethau gov.uk mewn ymdrech i gasglu eich gwybodaeth

source: The online service also uses cookies from the Government Digital Service (GDS). These cookies collect information to help improve the user experience across government digital services.
cy: Mae’r gwasanaeth ar-lein hefyd yn defnyddio cwcis o Wasanaeth Digidol y Llywodraeth

source: You can change <a class="govuk-link" href="%(cookie_settings_url)s">your cookie settings</a> to opt in or out of how different cookies are used.
cy: <a class="govuk-link" href="%(cookie_settings_url)s">Gallwch newid eich gosodiadau cwcis er mwyn optio i mewn neu allan o’r ffordd y defnyddir gwahanol gwcis.</a>

source: You can read more about <a class="govuk-link" href="%(cookie_url)s">cookies used on Check if you can get legal aid</a>.
cy: <a class="govuk-link" href="%(cookie_url)s">Gallwch ddarllen mwy am y cwcis sy’n cael eu defnyddio ar ‘Gwirio os ydych yn gymwys i gael cymorth cyfreithiol’</a>

source: You can read about <a class="govuk-link" href="http://www.aboutcookies.org/" rel="external">how to manage cookies</a>.
cy: <a class="govuk-link" href="http://www.aboutcookies.org/" rel="external">Mae gwybodaeth am ffyrdd o reoli cwcis yma</a>.

source: When will we share information about you outside <abbr>CLA</abbr>?
cy: Pryd y byddwn ni’n rhannu gwybodaeth amdanoch chi y tu allan i <abbr>CLA</abbr>?

source: Confidentiality means ensuring information is only accessible by those allowed to have access to it.
cy: Mae cyfrinachedd yn golygu sicrhau mai dim ond y rheini sydd â hawl i weld gwybodaeth a fydd yn ei gweld.

source: We want to keep your contact with <abbr>CLA</abbr> confidential, which means you can feel safe talking to us. But we sometimes need to share some information outside <abbr>CLA</abbr> which we explain below.
cy: Rydyn ni am gadw’ch cysylltiad â <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yn gyfrinachol: mae hyn yn golygu y byddwch chi’n gallu teimlo’n ddiogel wrth siarad â ni. Ond weithiau bydd angen i ni rannu rhywfaint o wybodaeth y tu allan i <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr>. Rydyn ni’n egluro hyn isod.

source: In order to provide you with the best service that we can we may share some information about you with the organisations mentioned below. But we will only do this if you have given us permission, when the operator asks for it, or when it is lawful to do so.
cy: Er mwyn darparu’r gwasanaeth gorau posibl i chi, mae’n bosibl y byddwn yn rhannu rhywfaint o wybodaeth amdanoch â’r sefydliadau y cyfeirir atynt isod. Ond ni fyddwn yn gwneud hyn oni bai eich bod wedi rhoi caniatâd i ni, pan fydd y gweithredwr yn gofyn am yr wybodaeth, neu pan mae’n gyfreithlon i ni wneud hynny.

source: Who we share information with
cy: Gyda phwy rydyn ni’n rhannu gwybodaeth

source: Who
cy: Pwy

source: Why
cy: Pam

source: External research organisations engaged by <abbr title="Legal Aid Agency">LAA</abbr> or the <abbr title="Ministry of Justice">MoJ</abbr>
cy: Sefydliadau ymchwil allanol sy’n gweithio i’r <abbr title="Asiantaeth Cymorth Cyfreithiol">LAA</abbr> neu’r Weinyddiaeth Cyfiawnder

source: To inform future government policy on legal aid. Such research will not identify individuals whose data has been used for research purposes.
cy: I gyfrannu at lunio polisi llywodraeth ar gymorth cyfreithiol yn y dyfodol. Ni fydd ymchwil o’r fath yn enwi unigolion y mae eu data wedi’u defnyddio ar gyfer ymchwil.

source: Other government organisations
cy: Sefydliadau llywodraeth eraill

source: These organisations may include the Department of Work and Pensions (DWP), HM Courts and Tribunals Service (HMCTS), HM Revenue and Customs (HMRC).
cy: Gall y sefydliadau hyn gynnwys yr Adran Gwaith a Phensiynau (<abbr>DWP</abbr>), Gwasanaeth Llysoedd a Thribiwnlysoedd Ei Mawrhydi (<abbr>HMCTS</abbr>), Cyllid a Thollau Ei Mawrhydi (<abbr>HMRC</abbr>).

source: To verify information provided by you and check whether you qualify for legal aid.
cy: I ddilysu gwybodaeth yr ydych chi wedi’i darparu a gwirio a ydych chi’n gymwys i gael cymorth cyfreithiol.

source: Other advice organisations and non-governmental organisations
cy: Sefydliadu cyngor a chyrff anllywodraethol eraill

source: These organisations may include credit reference agencies.
cy: Gall y sefydliadau hyn gynnwys asiantaethau gwirio credyd.

source: To help you get further help and advice from appropriate organisations.
cy: I’ch helpu i gael help a chyngor pellach gan sefydliadau priodol.

source: To verify information provided by you, when conducting audits on our decisions and eligibility assessments.
cy: I wirio gwybodaeth a roddir gennych, wrth gynnal archwiliadau yn ymwneud â’n penderfyniadau ac asesiadau cymhwystra.

source: When this is necessary, we will comply with all aspects of the relevant data protection laws.
cy: Pan fydd angen gwneud hyn, byddwn yn cydymffurfio â’r cyfreithiau diogelu data perthnasol yn eu cyfanrwydd.

source: In exceptional circumstances we may share limited information without your consent, for example if it is a legal requirement or a court compels us to do so.
cy: Mewn amgylchiadau eithriadol, gallwn ni rannu gwybodaeth benodol heb gael cydsyniad gennych chi, er enghraifft, os yw’n ofyniad cyfreithiol neu os bydd llys yn ein gorfodi i wneud hynny.

source: If we do this, we will wherever possible:
cy: Os byddwn yn gwneud hyn, lle bynnag y bo modd, byddwn yn:

source: Talk to you first
cy: yn siarad â chi’n gyntaf

source: Give you as much control as possible over how we do this
cy: yn rhoi cymaint o reolaeth â phosibl dros y ffordd y byddwn ni’n gwneud hyn

source: Only share information on a ‘need to know’ basis.
cy: yn rhannu gwybodaeth ar sail ‘yr angen i wybod’ yn unig.

source: To prevent fraud and to help detect crime.
cy: I atal twyll a helpu i ganfod troseddau.

source: Or where it is required by law or by a court order
cy: Neu os yw’n ofynnol o dan y gyfraith neu orchymyn llys

source: External protection organisations
cy: Sefydliadau diogelu allanol

source: If we are very worried about your safety or the safety of other people we may need to let others know. <br><br> For example if we think it necessary in order to protect a child, young person or vulnerable adult from abuse or if we think that there is an immediate risk of harm.
cy: Os ydyn ni’n pryderu’n fawr am eich diogelwch chi neu bobl eraill, mae’n bosibl y bydd angen i ni roi gwybod i bobl eraill. Er enghraifft, os ydyn ni’n credu ei bod yn angenrheidiol er mwyn diogelu plentyn, person ifanc neu oedolyn agored i niwed rhag cael ei gam-drin neu os ydyn ni’n credu bod rhywun mewn perygl uniongyrchol o gael niwed.

source: Access to personal information
cy: Mynediad at wybodaeth bersonol

source: You can find out if we hold any personal data about you and request a copy of this information by writing to the Legal Aid Agency to make a ‘subject access request’. If you wish to make a subject access request, you will need to contact:
cy: Gallwch ddarganfod a ydym yn cadw unrhyw ddata personol amdanoch a gofyn am gopi o’r wybodaeth hon drwy ysgrifennu at yr Asiantaeth Cymorth Cyfreithiol i wneud ‘cais am fynediad at ddata gan y testun’. Er mwyn gwneud cais am fynediad at ddata gan y testun, bydd angen i chi gysylltu â’r Tîm Datgelu yn y cyfeiriad isod:

source: You can also email at <a class="govuk-link email" href="mailto:data.access@justice.gov.uk">data.access@justice.gov.uk</a>.
cy: Gallwch hefyd anfon e-bost i <a class="govuk-link email" href="mailto:data.access@justice.gov.uk">data.access@justice.gov.uk</a>.

source: When making a subject access request for a copy of your personal information, please provide the following information:
cy: Wrth wneud cais am fynediad at ddata gan y testun, er mwyn cael copi o’ch gwybodaeth bersonol, dylech roi’r wybodaeth a ganlyn:

source: Full name
cy: Enw llawn

source: Address
cy: Cyfeiriad

source: Date of birth
cy: Dyddiad geni

source: What you contacted <abbr>CLA</abbr> about
cy: Y mater yr oeddech chi wedi cysylltu â <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yn ei gylch

source: When you contacted <abbr>CLA</abbr>
cy: Pryd yr oeddech chi wedi cysylltu â <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr>

source: What information you want to see
cy: Pa wybodaeth yr ydych chi am ei gweld

source: Any additional information that might help us to check your identity e.g. <abbr>CLA</abbr> case reference number. This is to help us protect your privacy by ensuring that we only give data out to the person it relates to (or their appropriately authorised representative).
cy: Unrhyw wybodaeth ychwanegol i’n helpu i wirio pwy ydych chi e.e. rhif cyfeirio achos <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr>. Bydd hyn yn ein helpu i ddiogelu’ch preifatrwydd drwy sicrhau mai dim ond i’r person y mae’r data’n ymwneud ag ef (neu gynrychiolydd sydd wedi’i awdurdodi’n briodol) y byddwn ni’n rhoi’r data.

source: You will also be required to provide proof of your identity. Acceptable forms of ID include:
cy: Bydd angen i chi hefyd gael tystiolaeth i gadarnhau pwy ydych chi. Mae’r dogfennau adnabod sy’n dderbyniol yn cynnwys:

source: a photocopy of your passport or driving licence
cy: llungopi o’ch pasbort neu’ch trwydded yrru

source: an electricity bill (the original bill, not a copy)
cy: bil trydan (y bil gwreiddiol, nid copi)

source: a gas bill (the original bill, not a copy)
cy: bil nwy (y bil gwreiddiol, nid copi)

source: a council tax bill (the original bill, not a copy)
cy: bil treth gyngor (y bil gwreiddiol, nid copi)

source: any other bill in your full name (the original bill, not a copy)
cy: unrhyw fil arall yn eich enw llawn (y bil gwreiddiol, nid copi)

source: Any bill you send us must be less than 6 months old.
cy: Rhaid i unrhyw fil y byddwch yn ei anfon atom fod yn llai na 6 mis oed.

source: Please note that we cannot give out any information unless the details that you provide match our records. If you used an alias or pseudonym when you contacted <abbr>CLA</abbr>, you will need to prove your identity.
cy: Sylwer na allwn roi unrhyw wybodaeth oni bai fod y manylion rydych chi’n eu rhoi yn cyfateb i’n cofnodion ni. Os gwnaethoch roi enw arall neu ffugenw pan wnaethoch chi gysylltu â <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr>, bydd angen i chi brofi pwy ydych chi.

source: Once we receive the subject access request, we will deal with the request without any undue delay within one calendar month.
cy: Ar ôl i ni dderbyn y cais am fynediad at ddata gan y testun, fe wnawn ni ymdrin ag ef heb oedi diangen o fewn un mis calendr.

source: There is no charge for providing this information, however, if processing the subject access request is deemed to be excessive, we may charge a fee.
cy: Nid ydym yn codi tâl am ddarparu’r wybodaeth hon, ond os byddwn yn credu bod prosesu’r cais am fynediad at ddata gan y testun yn gostus, mae gennym hawl i godi tâl.

source: You can also review our <a class="govuk-link" href="https://www.gov.uk/government/organisations/legal-aid-agency/about/personal-information-charter" rel="external">Personal Information Charter</a> which contains important information on your rights to access your personal information.
cy: Gallwch hefyd edrych ar ein <a class="govuk-link" href="https://www.gov.uk/government/organisations/legal-aid-agency/about/personal-information-charter" rel="external">Siarter Gwybodaeth Bersonol</a> sy’n cynnwys gwybodaeth bwysig am eich hawl i gael mynediad at wybodaeth bersonol a gedwir amdanoch.

source: How you can request to have your personal data amended or deleted?
cy: Sut allwch chi wneud cais i gael newid neu ddileu eich data personol?

source: Under data protection legislation, we are only allowed to keep your personal information when we have a lawful basis for processing it and only for as long as it is necessary for the purposes for which it was collected.
cy: Dan y ddeddfwriaeth diogelu data, nid oes gennym hawl i gadw eich gwybodaeth bersonol oni bai fod sail gyfreithlon dros ei phrosesu, ac ni chawn ei chadw am fwy o amser nag sy’n angenrheidiol ar gyfer y dibenion y casglwyd yr wybodaeth ar eu cyfer.

source: We will consider requests to delete some or all of your personal data but please note that, as a minimum, <abbr>CLA</abbr> will usually retain:
cy: Byddwn yn ystyried ceisiadau i ddileu eich holl ddata personol, neu rai data, ond dylech fod yn ymwybodol y bydd <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> fel arfer yn cadw’r canlynol o leiaf:

source: For everyone that uses our service, a name and two other pieces of personal data, e.g. date of birth and postcode
cy: Ar gyfer pawb sy’n defnyddio’n gwasanaeth, enw a dau ddarn arall o ddata personol, e.e. dyddiad geni a chod post

source: For everyone that asks <abbr>CLA</abbr> to check whether they qualify for legal aid in order to seek advice from a <abbr>CLA</abbr> Specialist, details of any financial information and case details used to prove that you qualify for legal aid
cy: Ar gyfer pawb sy’n gofyn i <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> wirio a ydynt yn gymwys i gael cymorth cyfreithiol er mwyn gofyn am gyngor gan un o Arbenigwyr <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr>, manylion unrhyw wybodaeth ariannol a manylion yr achos a ddefnyddir i brofi eich bod yn gymwys i gael cymorth cyfreithiol

source: Please note that, if you qualify to receive advice from a <abbr>CLA</abbr> Specialist, they will also need to retain additional personal data about you within their own Case Handling System. Such data shall be sufficient to justify the provision of legal aid advice and meet professional requirements.
cy: Sylwer, os byddwch yn gymwys i gael cyngor gan un o Arbenigwyr <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr>, bydd angen iddynt hefyd gadw data personol ychwanegol amdanoch yn eu System Ymdrin ag Achosion. Bydd data o’r fath yn ddigon i gyfiawnhau darparu cyngor am gymorth cyfreithiol a bodloni gofynion proffesiynol.

source: If the information we hold about you is inaccurate for whatever reason, you can contact CLA to have your personal information amended.
cy: Os yw’r wybodaeth rydym yn ei chadw amdanoch yn anghywir am unrhyw reswm, gallwch gysylltu â <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> i ofyn i ni newid eich gwybodaeth bersonol.

source: When we ask you for personal data
cy: Pan fyddwn yn gofyn am eich data personol

source: We promise to inform you why we need your personal data and ask only for the personal data we need. We will not collect information that is irrelevant or unnecessary.
cy: Rydym yn addo dweud wrthych pam y mae arnom angen eich data personol a gofyn am ddim mwy na’r data personol y mae arnom eu hangen. Ni fyddwn yn casglu gwybodaeth sy’n amherthnasol neu nad oes ei hangen.

source: When we collect your personal data, we have responsibilities, and you have rights. These include:
cy: Pan fyddwn yn casglu eich data personol, mae gennym ni gyfrifoldebau, ac mae gennych chi hawliau. Mae’r rhain yn cynnwys y canlynol:

source: That you can withdraw consent at any time, where relevant;
cy: Gallwch dynnu cydsyniad yn ôl unrhyw bryd, lle bo’n berthnasol;

source: That you can lodge a complaint with the supervisory authority;
cy: Gallwch gyflwyno cwyn i’r awdurdod sy’n goruchwylio;

source: That we will protect and ensure that no unauthorised person has access to it;
cy: Byddwn yn cadw’r data’n ddiogel ac yn sicrhau na fydd neb yn cael mynediad atynt heb ganiatâd;

source: That your personal data is shared with other organisations only for legitimate purposes;
cy: Ni fydd eich data personol yn cael eu rhannu â sefydliadau eraill ac eithrio at ddibenion cyfreithlon;

source: That we don’t keep it longer than is necessary;
cy: Ni fyddwn yn cadw’r data am fwy o amser nag sydd raid;

source: That we will not make your personal data available for commercial use without your consent; and
cy: Ni fyddwn yn rhyddhau eich data personol at ddibenion masnachol heb eich caniatâd; a

source: That we will consider your request to correct, stop processing or erase your personal data.
cy: Byddwn yn ystyried eich cais i gywiro, rhoi’r gorau i brosesu neu ddileu eich data personol.

source: You can get more details on:
cy: Gallwch gael rhagor o fanylion am y canlynol:

source: Agreements we have with other organisations for sharing information;
cy: Cytundebau sydd gennym â sefydliadau eraill er mwyn rhannu gwybodaeth;

source: Circumstances where we can pass on personal information without telling you, for example, to help with the prevention or detection of crime or to produce anonymised statistics;
cy: Amgylchiadau lle gallwn anfon gwybodaeth bersonol ymlaen heb ddweud wrthych, er enghraifft, i helpu i atal neu i ganfod troseddau neu er mwyn cynhyrchu ystadegau dienw;

source: Our instructions to staff on how to collect, use or delete your personal information;
cy: Ein cyfarwyddiadau i staff ynglŷn â sut i gasglu, defnyddio neu ddileu eich gwybodaeth bersonol;

source: How we check that the information we hold is accurate and up-to-date; and
cy: Sut i wirio bod yr wybodaeth rydym yn ei chadw yn gywir ac yn gyfredol; a

source: How to make a complaint.
cy: Sut i wneud cwyn.

source: For more information about the above issues, please contact the <abbr>MoJ</abbr> Data Protection Officer:
cy: I gael rhagor o wybodaeth am y materion uchod, cysylltwch â Swyddog Diogelu Data’r Weinyddiaeth Gyfiawnder:

source: For more information on how and why your information is processed, please see the information provided when you accessed our services or were contacted by us.
cy: I gael rhagor o wybodaeth ynglŷn â sut a pham mae eich gwybodaeth yn cael ei phrosesu, darllenwch yr wybodaeth a roddwyd i chi pan wnaethoch chi ddefnyddio ein gwasanaeth neu pan wnaethom ni gysylltu â chi.

source: When we ask you for information, we will comply with the law. If you consider that your information has been handled incorrectly, you can contact the Information Commissioner for independent advice about data protection. You can contact the Information Commissioner at:
cy: Pan fyddwn yn gofyn i chi am wybodaeth, byddwn yn cydymffurfio â’r gyfraith. Os ydych yn credu nad yw eich gwybodaeth wedi cael ei thrin yn iawn, gallwch gysylltu â’r Comisiynydd Gwybodaeth i gael cyngor annibynnol am ddiogelu data. Gallwch gysylltu â’r Comisiynydd Gwybodaeth yn y cyfeiriad isod:

source: Telephone:
cy: Ffôn:

source: Changes to the statement
cy: Newidiadau yn y datganiad
