Repository: ministryofjustice/cla_public
Catalog: cla_public/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: Include the full amount owed, even if the property has shared ownership, or enter 0 if you have no mortgage
cy: Rhowch y cyfanswm sy’n ddyledus, hyd yn oed os yw perchenogaeth yr eiddo wedi’i rhannu, neu rhowch 0 os nad oes gennych forgais

source: Please enter 0 if you have no mortgage
cy: Rhowch 0 os nad oes gennych forgais

source: How much was your monthly mortgage repayment last month?
cy: Beth oedd swm eich ad-daliad misol ar y morgais ar gyfer y mis diwethaf?

source: Do you rent out any part of this property?
cy: Ydych chi’n gosod unrhyw ran o’r eiddo ar rent?

source: If Yes, how much rent did you receive last month?
cy: Os ydych, beth oedd swm y rhent y cawsoch fis diwethaf?

source: Is your share of the property in dispute?
cy: A oes anghydfod ynghylch eich cyfran chi o’r eiddo?

source: For example, as part of the financial settlement of a divorce
cy: Er enghraifft, fel rhan o’r setliad ariannol mewn ysgariad

source: You and your partner’s property
cy: Eich eiddo chi ac eiddo’ch partner

source: Your property
cy: Eich eiddo

source: You and your partner’s savings
cy: Eich cynilion chi a’ch partner

source: Your savings
cy: Eich cynilion

source: Savings
cy: Cynilion

source: The total amount of savings in cash, bank or building society; or enter 0 if you have none
cy: Cyfanswm y cynilion mewn arian parod, yn y banc neu mewn cymdeithas adeiladu; neu rhowch 0 os nad oes gennych rai

source: Enter 0 if you have no savings
cy: Rhowch 0 os nad oes gennych gynilion

source: Investments
cy: Buddsoddiadau

source: This includes stocks, shares, bonds (but not property); enter 0 if you have none
cy: Mae hyn yn cynnwys stociau, cyfrannau, bondiau (ond nid eiddo); rhowch 0 os nad oes gennych rai

source: Enter 0 if you have no investments
cy: Rhowch 0 os nad oes gennych fuddsoddiadau

source: Total value of items worth over £500 each
cy: Cyfanswm gwerth eitemau sy’n werth mwy na £500 yr un

source: Enter 0 if you have no valuable items worth over £500 each
cy: Rhowch 0 os nad oes gennych eitemau gwerthfawr sy’n werth dros £500 yr un

source: Wages before tax
cy: Cyflog cyn treth

source: This includes any earnings from self-employment
cy: Mae hyn yn cynnwys unrhyw enillion o waith hunangyflogedig

source: This includes all wages and any earnings from self-employment
cy: Mae hyn yn cynnwys eich cyflog i gyd ac unrhyw enillion o waith hunangyflogedig

source: Income tax
cy: Treth incwm

source: Tax paid directly out of wages
cy: Treth sy’n cael ei thalu’n uniongyrchol o’ch cyflog

source: Any tax paid on self-employed earnings
cy: Unrhyw dreth sy’n cael ei thalu o enillion gwaith hunangyflogedig

source: Tax paid directly out of wages and any tax paid on self-employed earnings
cy: Treth sy’n cael ei thalu’n uniongyrchol o’ch cyflog ac unrhyw dreth yr ydych yn ei thalu ar enillion gwaith hunangyflogedig

source: National Insurance contributions
cy: Cyfraniadau Yswiriant Gwladol

source: Check the payslip
cy: Edrychwch ar y slip cyflog

source: Check the National Insurance statement
cy: Edrychwch ar y datganiad Yswiriant Gwladol

source: Check the payslip or National Insurance statement if self-employed
cy: Edrychwch ar y slip cyflog neu’r datganiad Yswiriant Gwladol os ydych yn hunangyflogedig

source: Working Tax Credit
cy: Credyd Treth Gwaith

source: Extra money for people who work and have a low income, enter 0 if this doesn’t apply to you
cy: Arian ychwanegol i bobl sy’n gweithio ac sydd ar incwm isel, rhowch 0 os nad yw hyn yn berthnasol i chi

source: Enter 0 if this doesn’t apply to you
cy: Rhowch 0 os nad yw hyn yn berthnasol i chi

source: Child Tax Credit
cy: Credyd Treth Plant

source: The total amount you get for all your children, enter 0 if this doesn’t apply to you
cy: Y cyfanswm yr ydych chi’n ei gael ar gyfer eich holl blant, rhowch 0 os nad yw hyn yn berthnasol i chi

source: Maintenance received
cy: Taliadau Cynhaliaeth yr ydych chi’n eu cael

source: Payments you get from an ex-partner, or enter 0 if this doesn’t apply to you
cy: Taliadau yr ydych chi’n eu cael gan gynbartner, neu rhowch 0 os nad yw hyn yn berthnasol i chi

source: Pension received
cy: Pensiwn yr ydych chi’n ei gael

source: Payments you receive if you’re retired, enter 0 if this doesn’t apply to you
cy: Taliadau yr ydych chi’n eu cael os ydych chi wedi ymddeol, rhowch 0 os nad yw hyn yn berthnasol i chi

source: Any other income
cy: Unrhyw incwm arall

source: For example, student grants, income from trust funds, dividends, or enter 0 if this doesn’t apply to you
cy: Er enghraifft, grantiau myfyriwr, incwm o gronfeydd ymddiriedolaeth, difidendau, neu rhowch 0 os nad yw hyn yn berthnasol i chi

source: Tell us how much you receive in wages
cy: Dywedwch wrthym faint o gyflog rydych chi’n ei dderbyn

source: Tell us how often you receive wages
cy: Dywedwch wrthym pa mor aml rydych chi’n derbyn cyflog

source: Tell us how much income tax you pay
cy: Dywedwch wrthym faint o dreth incwm rydych chi’n ei thalu

source: Tell us how often you pay income tax
cy: Dywedwch wrthym pa mor aml rydych chi’n talu treth incwm

source: Tell us how much National Insurance you pay
cy: Dywedwch wrthym faint o Yswiriant Gwladol rydych chi’n ei dalu

source: Tell us how often you pay National Insurance
cy: Dywedwch wrthym pa mor aml rydych chi’n talu Yswiriant Gwladol

source: Enter the Working Tax Credit you receive, or 0 if this doesn’t apply to you
cy: Rhowch y Credyd Treth Gwaith rydych chi’n ei dderbyn, neu 0 os nad yw’n berthnasol i chi

source: Tell us how often you receive Working Tax Credit
cy: Dywedwch wrthym pa mor aml rydych chi’n derbyn Credyd Treth Gwaith

source: Tell us how much Working Tax Credit you receive
cy: Dywedwch wrthym faint o Gredyd Treth Gweithio rydych chi’n ei dderbyn

source: Enter the Child Tax Credit you receive, or 0 if this doesn’t apply to you
cy: Rhowch y Credyd Treth Plant rydych chi’n ei dderbyn, neu 0 os nad yw’n berthnasol i chi

source: Tell us how often you receive Child Tax Credit
cy: Dywedwch wrthym pa mor aml rydych chi’n derbyn Credyd Treth Plant

source: Tell us how much Child Tax Credit you receive
cy: Dywedwch wrthym faint o Gredyd Treth Plant rydych chi’n ei dderbyn

source: Tell us how much your partner receives in wages
cy: Dywedwch wrthym faint mae eich partner yn ei dderbyn mewn cyflogau

source: Tell us how often your partner receives wages
cy: Dywedwch wrthym pa mor aml mae eich partner yn derbyn cyflog

source: Tell us how much income tax your partner pays
cy: Dywedwch wrthym faint o dreth incwm mae eich partner yn ei thalu

source: Tell us how often your partner pays income tax
cy: Dywedwch wrthym pa mor aml mae eich partner yn talu treth incwm

source: Tell us how much National Insurance your partner pays
cy: DywDywedwch wrthym faint o Yswiriant Gwladol mae eich partner yn ei dalu

source: Tell us how often your partner pays National Insurance
cy: Dywedwch wrthym pa mor aml mae eich partner yn talu Yswiriant Gwladol

source: Enter the Working Tax Credit your partner receives, or 0 if it doesn’t apply
cy: Rhowch y Credyd Treth Gwaith mae eich partner yn ei dderbyn, neu 0 os nad yw’n berthnasol

source: Tell us how often your partner receives Working Tax Credit
cy: Dywedwch wrthym pa mor aml mae eich partner yn derbyn Credyd Treth Gwaith

source: Tell us how much Working Tax Credit your partner receives
cy: Dywedwch wrthym faint o Gredyd Treth Gweithio mae eich partner yn ei dderbyn

source: Enter the total amount of maintenance your partner receives, or 0 if this doesn’t apply
cy: Rhowch gyfanswm y taliadau cynnal mae eich partner yn eu derbyn, neu 0 os nad yw hyn yn berthnasol

source: Tell us how much maintenance your partner receives
cy: Dywedwch wrthym faint o daliadau cynnal mae eich partner yn eu derbyn

source: Tell us how often your partner receives maintenance
cy: Dywedwch wrthym pa mor aml mae eich partner yn eu derbyn daliadau cynnal

source: Enter the pension your partner receives, or 0 if this doesn’t apply
cy: Rhowch y pensiwn mae eich partner yn ei dderbyn, neu 0 os nad yw hyn yn berthnasol

source: Tell us how often your partner receives their pension
cy: Dywedwch wrthym pa mor aml mae eich partner yn derbyn ei bensiwn

source: Tell us how much pension your partner receives
cy: Dywedwch wrthym faint o bensiwn mae eich partner yn ei dderbyn

source: Enter the other income your partner receives, or 0 if this doesn’t apply
cy: Rhowch yr incwm arall mae eich partner yn ei dderbyn, neu 0 os nad yw hyn yn berthnasol

source: Tell us how often your partner receives this other income
cy: Dywedwch wrthym pa mor aml mae eich partner yn derbyn yr incwm arall hwn

source: Tell us how much other income your partner receives
cy: Dywedwch wrthym faint o incwm arall mae eich partner yn ei dderbyn

source: Tell us how much you pay towards childcare
cy: Dywedwch wrthym faint rydych chi’n ei dalu tuag at ofal plant

source: Tell us how often you pay childcare costs
cy: Dywedwch wrthym pa mor aml rydych chi’n talu costau gofal plant

source: Enter the Child Benefit you receive
cy: Nodwch y Budd-dal Plant rydych chi’n ei dderbyn

source: Tell us how much Child Benefit you receive
cy: Dywedwch wrthym faint o Fudd-dal Plant rydych chi’n ei dderbyn

source: Tell us how often you receive Child Benefit
cy: Dywedwch wrthym pa mor aml rydych chi’n derbyn Budd-dal Plant

source: Enter a number
cy: Rhowch rif

source: Enter an amount less than £100,000,000
cy: Rhowch swm llai na £100,000,000

source: Enter an amount more than £0
cy: Rhowch swm mwy na £0

source: Tell us what number to ring
cy: Dywedwch wrthym pa rif i’w ffonio

source: Tell us the name of the person to call
cy: Dywedwch wrthym beth yw enw’r unigolyn y dylem ei ffonio

source: Their full name must be 400 characters or less
cy: Rhaid i’w enw llawn fod yn 400 nod neu lai

source: Tell us how you know this person
cy: Dywedwch wrthym sut rydych chi’n adnabod yr unigolyn hwn

source: Tell us your name
cy: Dywedwch wrthym beth yw eich enw

source: Tell us how we should get in contact
cy: Dywedwch wrthym sut dylem gysylltu

source: Enter a valid email address
cy: Rhowch gyfeiriad e-bost dilys

source: Tell us what email address to send to
cy: Dywedwch wrthym pa gyfeiriad e-bost y dylem ei ddefnyddio i anfon

source: You and your partner’s income and tax
cy: Eich incwm a’ch treth chi a’ch partner

source: You and your partner’s money coming in
cy: Arian sy’n dod i mewn gennych chi a’ch partner

source: Your income and tax
cy: Eich incwm a’ch treth

source: Your money coming in
cy: Eich enillion rydych yn ei ennill

source: Your personal income
cy: Eich incwm personol

source: Your partner’s income
cy: Arian y mae eich partner yn ei ennill

source: You and your partner’s outgoings
cy: Eich alldaliadau chi a’ch partner

source: Your outgoings
cy: Eich taliadau allan

source: Rent
cy: Rhent

source: Money you pay your landlord for rent, or enter 0 if you don’t pay rent. Do not include rent that is paid by Housing Benefit.
cy: Arian yr ydych chi yn ei dalu i’ch landlord fel rhent, neu rhowch 0 os nad ydych yn talu rhent. Peidiwch â chynnwys rhent sy’n cael ei dalu gan fudd-dal tai.

source: Money you and your partner pay your landlord for rent, or enter 0 if you don’t pay rent. Do not include rent that is paid by Housing Benefit.
cy: Arian yr ydych chi a’ch partner yn ei dalu i’ch landlord fel rhent, neu rhowch 0 os nad ydych yn talu rhent. Peidiwch â chynnwys rhent sy’n cael ei dalu gan fudd-dal tai.

source: Enter 0 if you don’t pay rent
cy: Rhowch 0 os nad ydych yn talu rhent

source: Maintenance
cy: Cynhaliaeth

source: Money you pay to an ex-partner for their living costs, or enter 0 if this doesn’t apply to you
cy: Arian yr ydych chi yn ei dalu i gynbartner at gostau byw, neu rhowch 0 os nad yw hyn yn berthnasol i chi

source: Money you and/or your partner pay to an ex-partner for their living costs, or enter 0 if this doesn’t apply
cy: Arian yr ydych chi a/neu’ch partner yn ei dalu i gynbartner at gostau byw, neu rhowch 0 os nad yw hyn yn berthnasol i chi

source: Monthly Income Contribution Order
cy: Gorchymyn Cyfrannu Incwm Misol

source: Money you pay per month towards your Criminal Legal Aid, or enter 0 if this doesn’t apply to you
cy: Arian yr ydych chi yn ei dalu at eich cymorth cyfreithiol troseddol, neu rhowch 0 os nad yw hyn yn berthnasol i chi

source: Money you and/or your partner pay per month towards your Criminal Legal Aid, or enter 0 if this doesn’t apply
cy: Arian yr ydych chi a/neu’ch partner yn ei dalu at eich cymorth cyfreithiol troseddol, neu rhowch 0 os nad yw hyn yn berthnasol i chi

source: Childcare
cy: Gofal plant

source: Money you pay for your child to be looked after while you work or study outside of your home
cy: Arian yr ydych chi yn ei dalu i rywun warchod eich plentyn tra’r ydych chi’n gweithio neu astudio y tu allan i’ch cartref

source: Money you and your partner pay for your child to be looked after while you work or study outside of your home
cy: Arian yr ydych chi a’ch partner yn ei dalu i rywun warchod eich plentyn tra’r ydych chi’n gweithio neu astudio y tu allan i’ch cartref

source: Review your answers
cy: Adolygu eich atebion

source: Enter postcode
cy: Rhowch eich côd post

source: Select at least one option
cy: Dewiswch o leiaf un opsiwn

source: Please provide an amount
cy: Rhowch swm

source: Type in a number
cy: Rhowch swm

source: Select a time period from the drop down
cy: Dewiswch gyfnod o’r gwymplen

source: There was an error submitting your data. Please check and try again.
cy: Roedd gwall wrth gyflwyno eich data. Gwiriwch a cheisiwch eto.

source: Error looking up legal advisers.
cy: Gwall wrth ddod o hyd i gynghorwyr cyfreithiol.

source: Please try again later.
cy: Rhowch gynnig arni eto yn nes ymlaen.

source: Call today
cy: Ffoniwch heddiw

source: Call on another day
cy: Ffoniwch ar ddiwrnod arall

source: Not a valid choice
cy: Nid yw hwn yn ddewis dilys

source: Not a valid date
cy: Nid yw hwn yn ddyddiad dilys

source: Not a valid time
cy: Nid yw hwn yn amser dilys

source: Can’t schedule a callback at the requested time
cy: Methu trefnu i’ch ffonio’n ôl ar yr amser a nodwyd yn eich cais

source: Arrange a callback time
cy: Trefnu amser i ffonio’n ôl

source: Time
cy: Amser

source: Day
cy: Dydd

source: Choose a language
cy: Dewiswch iaith

source: British Sign Language – Webcam
cy: Iaith Arwyddion Prydain – Gwe-gamera

source: Minicom – for textphone users
cy: Minicom - ar gyfer defnyddwyr ffôn testun

source: Text Relay – for people with hearing or speech impairments
cy: Trosglwyddo Neges Destun - ar gyfer pobl sydd â nam ar y clyw neu ar y lleferydd

source: Welsh
cy: Cymraeg

source: Other language
cy: Iaith arall

source: Language required
cy: Iaith sydd ei hangen

source: Any other communication needs
cy: Unrhyw anghenion cyfathrebu eraill

source: Other communication needs
cy: Anghenion cyfathrebu eraill

source: Please tell us what you need in the box below
cy: Dywedwch wrthym beth sydd arnoch ei angen yn y blwch isod

source: Your other communication needs must be 4000 characters or less
cy: Ni ddylai eich anghenion cyfathrebu eraill fod yn fwy na 4000 o lythrennau

source: Phone number for the callback
cy: Rhif ffôn ar gyfer eich ffonio’n ôl

source: Please enter full phone number including area code, using only numbers. For example 020 7946 0492
cy: Rhowch eich rhif ffôn yn llawn, yn cynnwys cod yr ardal, gan ddefnyddio rhifau yn unig. Er enghraifft 020 7946 0492

source: Your telephone number must be 20 characters or less
cy: Rhaid i’ch rhif ffôn fod yn 20 llythyren neu lai

source: Select a time for us to call
cy: Dewiswch amser i ni eich ffonio

source: Full name of the person to call
cy: Enw llawn yr unigolion i’w ffonio

source: Your full name must be 400 characters or less
cy: Rhaid i’ch enw llawn fod yn 400 nod neu lai

source: Relationship to you
cy: Ei gysylltiad/chysylltiad â chi

source: Postcode
cy: Côd post

source: Your postcode must be 12 characters or less
cy: Rhaid i’ch côd post fod yn 12 nod neu lai

source: Street address
cy: Cyfeiriad y stryd

source: Your address must be 255 characters or less
cy: Rhaid i’ch cyfeiriad fod yn 255 nod neu lai

source: Your full name
cy: Eich enw llawn

source: Select a contact option
cy: Dewiswch opsiwn ar gyfer cysylltu

source: Please choose one of the options
cy: Dewiswch o leiaf un opsiwn

source: Email
cy: E-bost

source: If you add your email we will send you the reference number when you submit your details
cy: Os byddwch yn ychwanegu eich cyfeiriad e-bost, byddwn yn anfon y cyfeirnod atoch pan fyddwch yn cyflwyno eich manylion

source: Invalid email address
cy: Cyfeiriad e-bost annilys

source: Tell us more about your problem
cy: Dywedwch fwy wrthym am eich problem

source: Your notes must be 4000 characters or fewer
cy: Rhaid i’ch nodiadau fod yn 4000 nod neu lai

source: Do you have any special communication needs? (optional)
cy: Oes gennych chi unrhyw anghenion cyfathrebu arbennig? (dewisol)

source: Receive this confirmation by email
cy: Cael copi o’r cadarnhad hwn drwy e-bost

source: Enter your email address
cy: Nodwch eich cyfeiriad e-bost

source: Your Civil Legal Advice reference number
cy: Eich cyfeirnod Cyngor Cyfreithiol Sifil

source: There was an error submitting your email. Please check and try again or try without it.
cy: Roedd gwall wrth anfon eich e-bost. Gwiriwch a cheisiwch eto, neu rhowch gynnig arni hebddo.

source: What do you need help with?
cy: Ar gyfer beth y mae arnoch chi angen cymorth?

source: Check if you can get legal aid
cy: Gwirio os y gallwch chi gael cymorth cyfreithiol

source: Infected Blood Support Scheme
cy: Cynllun Cefnogi Gwaed Heintiedig

source: Vaccine Damage Payment
cy: Taliad Niwed Trwy Frechiad

source: Criminal Injuries Compensation Scheme
cy: Y Cynllun Iawndal Am Anafiadau Troseddol

source: London Emergencies Trust
cy: Ymddiriedolaeth Argyfyngau Llundain

source: Legal aid can help pay for legal advice.
cy: Gall cymorth cyfreithiol helpu i dalu am gyngor cyfreithiol.

source: You’ll be asked general questions about your legal problem and your income and savings. You’ll be told where you can get legal advice.
cy: Byddwch yn cael eich holi’n gyffredinol am eich problem gyfreithiol, eich incwm â’ch cynilion. Byddwch yn cael gwybod ble gallwch gael cyngor cyfreithiol.

source: This guide is also available <a class="govuk-link" lang="cy" href="/locale/cy_GB" data-ga="event:locale/switch/welsh">in Welsh (Cymraeg)</a>
cy: Mae’r canllaw hwn hefyd ar gael <a class="govuk-link" lang="en" href="/locale/en_GB" data-ga="event:locale/switch/english">yn Saesneg (English)</a>

source: Start now
cy: Dechrau nawr

source: You can only check for non-criminal (‘civil’) cases. If you’ve been charged with a crime, ask your solicitor or barrister if you’re able to get criminal legal aid.
cy: Gallwch wirio ar gyfer achosion sydd ddim yn droseddol yn unig (‘sifil’). Os ydych chi wedi cael eich cyhuddo o drosedd, gofynnwch i’ch cyfreithiwr neu fargyfreithiwr os oes modd i chi gael cymorth cyfreithiol troseddol.

source: You’ll only get guidance on whether or not you can get legal aid - you will not get a final decision until you speak to an adviser.
cy: Byddwch yn cael arweiniad ynghylch p’un a ydych yn gallu cael cymorth cyfreithiol ai peidio yn unig – ni fyddwch yn cael penderfyniad terfynol nes eich bod yn siarad â chynghorydd.

source: Scotland
cy: Alban

source: Northern Ireland
cy: Gogledd Iwerddon

source: Legal aid is different in %(Scotland_legal_aid_link)s and %(Ulster_legal_aid_link)s.
cy: Mae cymorth cyfreithiol yn wahanol yn yr %(Scotland_legal_aid_link)s a %(Ulster_legal_aid_link)s.

source: This field must be left empty
cy: Rhaid gadael y maes hwn yn wag

source: Leave this field empty
cy: Gadewch y maes hwn yn wag

source: Your cookie settings were saved
cy: Cafodd eich dewisiadau cwcis eu cadw

source: Government services may set additional cookies and, if so, will have their own cookie policy and banner.
cy: Gall gwasanaethau’r llywodraeth osod cwcis ychwanegol, ac os felly, bydd ganddynt bolisi a baner cwcis eu hunain.

source: Go back to the page you were looking at
cy: Ewch yn ôl i’r dudalen yr oeddech chi arni gynt

source: Cookies are files saved on your phone, tablet or computer when you visit a website.
cy: Ffeiliau sy’n cael eu cadw ar eich ffôn, tabled neu gyfrifiadur pan fyddwch yn ymweld â gwefan yw cwcis.

source: We use cookies to store information about how you use ‘Check if you can get legal aid’, such as the pages you visit.
cy: Rydym yn defnyddio cwcis i storio gwybodaeth ynglŷn â sut rydych yn defnyddio ‘Gwirio os ydych yn gymwys i gael cymorth cyfreithiol’, er enghraifft y tudalennau rydych yn ymweld â nhw.

source: Cookies on Check if you can get Legal Aid
cy: Cwcis ar Wirio os ydych yn gymwys i gael Cymorth Cyfreithiol

source: We use <a class="govuk-link" href="%(cookie_info_url)s">cookies to collect information</a> about how you use GOV.UK.
cy: Rydyn ni’n defnyddio <a class="govuk-link" href="%(cookie_info_url)s">cwcis i gasglu gwybodaeth</a> am y ffordd rydych chi’n defnyddio GOV.UK.

source: We use this information to make the website work as well as possible and improve government services.
cy: Rydyn ni’n defnyddio’r wybodaeth hon i wneud i’r wefan weithio cystal â phosib ac i well gwasanaethau’r llywodraeth.

source: Accept all cookies
cy: Derbyn cwcis

source: Set cookie preferences
cy: Gosod dewisiadau cwcis

source: Cookie settings
cy: Gosodiadau cwcis

source: We use Javascript to set most of our cookies. Unfortunately Javascript is not running on your browser, so you cannot change your settings. You can try:
cy: Rydym yn defnyddio Javascript i osod y mwyafrif o’n cwcis Yn anffodus, nid yw Javascript yn weithredol ar eich porwr, felly ni allwch newid eich dewisiadau. Gallwch drio:

source: reloading the page
cy: ail-lwytho’r dudalen

source: turning on Javascript in your browser
cy: troi Javascript ymlaen yn eich porwr

source: We use different types of cookies. You can choose which cookies you’re happy for us to use and how the data is shared.
cy: Rydym yn defnyddio gwahanol fathau o gwcis. Gallwch ddewis pa gwcis rydych yn fodlon i ni eu defnyddio a sut y rhennir y data.

source: Strictly necessary cookies
cy: Cwcis hollol angenrheidiol

source: We use essential cookies to help you use the ‘Check if you can get legal aid’ service. These do things such as:
cy: Rydym yn defnyddio cwcis hanfodol i’ch helpu i ddefnyddio’r gwasanaeth ‘Gwirio os ydych yn gymwys i gael cymorth cyfreithiol’. Mae’r rhain yn gwneud pethau fel:

source: remember your progress through our service
cy: cofio sut rydych yn symud ymlaen wrth ddefnyddio’n gwasanaeth

source: remember you have seen the cookies message
cy: cofio eich bod wedi gweld y neges cwcis

source: remember the language you have selected to view our service
cy: cofio’r iaith rydych wedi’i dewis i edrych ar ein gwasanaeth

source: These cookies need to be on to give you the best experience using the service.
cy: Mae angen i’r cwcis hyn fod ar waith er mwyn i chi gael y profiad gorau wrth ddefnyddio’r gwasanaeth.

source: Read more about cookies on ‘Check if you can get legal aid’
cy: Darllenwch fwy am ddefnyddio cwcis ar ‘Gwirio os ydych yn gymwys i gael cymorth cyfreithiol’

source: Cookies used to improve ‘Check if you can get legal aid’
cy: Cwcis sy’n cael eu defnyddio i wella ‘Gwirio os ydych yn gymwys i gael cymorth cyfreithiol’

source: We use Google Analytics to measure how you use ‘Check if you can get legal aid’ so we can improve it based on user needs.
cy: Rydym yn defnyddio Google Analytics i fesur sut rydych yn defnyddio ‘Gwirio os ydych yn gymwys i gael cymorth cyfreithiol’ er mwyn i ni allu gwella’r gwasanaeth ar sail anghenion defnyddwyr.
