Repository: ministryofjustice/cla_public
Catalog: cla_public/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: We do not allow Google to use or share the data about how you use this site.
cy: Nid ydym yn gadael i Google ddefnyddio na rhannu’r data ynglŷn â sut rydych yn defnyddio’r safle hwn.

source: You agree to the Ministry of Justice using your data to help improve the ‘Check if you can get legal aid’ service.
cy: Rydych yn cytuno y gall y Weinyddiaeth Gyfiawnder ddefnyddio eich data i helpu i wella’r gwasanaeth ‘Gwirio os ydych yn gymwys i gael cymorth cyfreithiol’.

source: On
cy: Ar waith

source: Off
cy: Diffodd

source: Cookies used by the Government Digital Service (GDS)
cy: Cwcis sy’n cael eu defnyddio gan Wasanaeth Digidol y Llywodraeth

source: You agree to the Government Digital Service collecting your data to improve the user experience across government digital services.
cy: Rydych yn cytuno y gall Gwasanaeth Digidol y Llywodraeth gasglu eich data er mwyn gwella profiad defnyddwyr ar draws gwasanaethau digidol y llywodraeth.

source: Find out how data is shared when you use this service
cy: Canfod sut mae data yn cael eu rhannu pan fyddwch yn defnyddio’r gwasanaeth hwn

source: Save changes
cy: Cadw newidiadau

source: We use cookies to make the site simpler.
cy: Rydym yn defnyddio cwcis i wneud y safle’n fwy hwylus.

source: Accept cookies
cy: Derbyn cwcis

source: You’ve accepted all cookies. You can <a class="govuk-link" href="%(cookie_settings_url)s" data-module="track-click" data-track-category="cookieBanner" data-track-action="Cookie banner settings clicked from confirmation">change your cookie settings</a> at any time.
cy: Rydych wedi cytuno i’r holl gwcis. Gallwch newid eich dewisiadau <a class="govuk-link" href="%(cookie_settings_url)s" data-module="track-click" data-track-category="cookieBanner" data-track-action="Cookie banner settings clicked from confirmation">cwcis unrhyw dro</a>.

source: Hide
cy: Cuddio

source: Your application will time out soon
cy: Bydd yr amser a neilltuwyd ar gyfer eich cais yn dod i ben cyn bo hir

source: Extend time limit
cy: Ymestyn y terfyn amser

source: Continue
cy: Ymlaen

source: Exit service
cy: Gadael y gwasanaeth

source: <a class="govuk-link" href="%(contact_url)s">Contact us</a> if you need help or would like to give feedback to improve this service
cy: <a class="govuk-link" href="%(contact_url)s">Cysylltwch â ni</a> os oes arnoch angen help neu os hoffech roi adborth i’n helpu i wella’r gwasanaeth hwn

source: Resources
cy: Adnoddau

source: Civil Legal Advice
cy: Cyngor Cyfreithiol Sifil

source: Legal aid
cy: Cymorth Cyfreithiol

source: Criminal legal aid
cy: Cymorth cyfreithiol troseddol

source: How this service protects your privacy
cy: Sut y mae’r gwasanaeth hwn yn diogelu’ch preifatrwydd

source: What valuable items should I include?
cy: Pa eitemau gwerthfawr dylwn i eu cynnwys?

source: Don’t include
cy: Peidiwch â chynnwys

source: Furniture and appliances
cy: Dodrefn ac offer tŷ

source: Your TV
cy: Eich set deledu

source: Mobile phones, laptops and other devices
cy: Ffonau symudol, gliniaduron a dyfeisiau eraill

source: Clothing
cy: Dillad

source: The vehicle you use every day, unless it is a classic car or luxury vehicle
cy: Y car yr ydych chi’n ei ddefnyddio bob dydd, oni bai ei fod yn gar clasurol neu’n gerbyd moethus

source: Equipment or tools you use for your work
cy: Cyfarpar neu offer yr ydych chi’n eu defnyddio ar gyfer eich gwaith

source: Do include
cy: Rhaid cynnwys

source: Jewellery
cy: Gemwaith

source: Art
cy: Gweithiau celfyddydol

source: Antiques
cy: Pethau hynafol

source: Caravans and other vehicles you don’t use every day
cy: Carafannau a cherbydau eraill nad ydych chi’n eu defnyddio bob dydd

source: Musical instruments, unless you’re a professional musician
cy: Offerynnau cerddorol, oni bai’ch bod yn gerddor proffesiynol

source: more info
cy: rhagor o wybodaeth

source: Close
cy: Cau

source: This form has errors
cy: Mae gwallau ar y ffurflen hon

source: Error
cy: Gwall

source: Show {count} more
cy: Dangos {count} mwy

source: Show {count} more sources of help
cy: Dangos {count} ffynhonnell cymorth arall

source: Staying safe online
cy: Cadw’n ddiogel ar-lein

source: staying safe online
cy: cadw’n ddiogel ar-lein

source: Privacy Policy
cy: Polisi preifatrwydd

source: Cookies
cy: Cwcis

source: Contact
cy: Cysylltu

source: Contact Civil Legal Advice
cy: Cyngor Cyfreithiol Sifil

source: The full service is currently unavailable. However, you can still get in touch using the form below.
cy: Nid yw’r gwasanaeth llawn ar gael ar hyn o bryd. Fodd bynnag, gallwch barhau i wneud cais i ni eich ffonio’n ôl gan ddefnyddio’r ffurflen isod.

source: If you’re in an emergency situation, please call the police on 999.
cy: Os ydych mewn sefyllfa argyfwng, ffoniwch yr heddlu ar 999.

source: Call charges apply
cy: Cyfraddau galwadau yn berthnasol

source: If you’re in immediate danger please call Civil Legal Advice on <strong class="laa-telephone">0345 345 4 345</strong>. %(call_charges_link)s.
cy: Os ydych mewn perygl uniongyrchol, ffonwich Cyngor Cyfreithiol Sifil ar <span class="laa-telephone">0345 345 4 345</span>. %(call_charges_link)s."

source: You can also ask us to call you back using the form below, which is free.
cy: Gallwch hefyd ofyn i ni eich ffonio’n ôl gan ddefnyddio’r ffurflen isod, sydd yn rhad ac am ddim.

source: Please submit your details to get in touch with Civil Legal Advice (CLA).
cy: Cyflwynwch eich manylion i gysylltu â Chyngor Cyfreithiol Sifil (CLA).

source: call charges
cy: cyfraddau galwadau

source: You can choose to contact CLA yourself and speak to someone immediately (this is an 0345 number - %(call_charges_link)s apply) or ask us to call you back, which is free.
cy: Gallwch ddewis cysylltu â CLA eich hun a siarad â rhywun ar unwaith (mae hwn yn rhif 0345 - %(call_charges_link)s) neu gallwch ofyn i ni eich ffonio yn ôl, sydd yn rhad ac am ddim.

source: You’ll need to provide evidence of the financial information (if any) you’ve given us through this service.
cy: Bydd angen i chi ddarparu tystiolaeth o’r wybodaeth ariannol yr ydych wedi ei rhoi i ni (os o gwbl) drwy’r gwasanaeth hwn.

source: We’ll give you the CLA phone number when you submit your details below.
cy: Byddwn yn rhoi rhif ffôn CLA i chi pan fyddwch yn cyflwyno eich manylion isod.

source: Submit details
cy: Cyflwyno manylion

source: Civil Legal Advice Privacy Statement
cy: Datganiad Preifatrwydd Cyngor Cyfreithiol Sifil

source: Protecting your personal data and your privacy is important to us. Read the full %(privacy_link)s.
cy: Mae diogelu’ch data personol a phreifatrwydd yn bwysig i ni. Darllennwch y %(privacy_link)s.

source: Find UK address
cy: Dod o hyd i gyfeiriad yn y DU

source: Select an address
cy: Dewiswch gyfeiriad

source: addresses found
cy: cyfeiriadau a ddethpwyd o hyd iddynt

source: characters remaining
cy: nodau ar ôl

source: Must contain a valid postcode
cy: Rhaid cynnwys côd post dilys

source: No addresses were found with that postcode, but you can still enter your address manually
cy: Ni ddaethpwyd o hyd i unrhyw gyfeiriadau gyda’r côd post hwn, ond gallwch roi eich cyfeiriad i mewn eich hun.

source: Request failed:
cy: Cais wedi methu:

source: Change your cookie settings
cy: Newid eich gosodiadau cwcis

source: The Check if you can get legal aid service puts small files (known as “cookies”) onto your computer to collect information about how you browse the site.
cy: Mae’r gwasanaeth ‘Gwirio os ydych yn gymwys i gael cymorth cyfreithiol’ yn rhoi ffeiliau bach (sy’n cael eu galw’n “cwcis”) ar eich cyfrifiadur i gasglu gwybodaeth ynglŷn â sut rydych yn pori drwy’r safle.

source: Cookies are used to:
cy: Defnyddir cwcis i wneud y canlynol:

source: measure how you use the website so it can be updated and improved based on your needs
cy: mesur sut yr ydych yn defnyddio’r wefan fel y gellir ei diweddaru a’i gwella ar sail eich anghenion

source: remember the notifications you’ve seen so that we don’t show them to you again
cy: cofio’r hysbysiadau yr ydych wedi’u gweld fel nad ydym yn eu dangos eto i chi

source: Check if you can get legal aid cookies aren’t used to identify you personally.
cy: Nid yw cwcis ‘Gwirio os ydych yn gymwys i gael cymorth cyfreithiol’ yn cael eu defnyddio i’ch adnabod chi’n bersonol.

source: You’ll normally see a message on the site before we store a cookie on your computer.
cy: Fel arfer, byddwch yn gweld neges ar y safle cyn inni storio cwci ar eich cyfrifiadur

source: how to manage cookies
cy: sut i reoli cwcis

source: aboutcookies.org
cy: aboutcookies.org (Saesneg)

source: Find out more about how to manage cookies at %(manage_cookies_link)s.
cy: Dysgwch fwy am sut i reoli cwcis yn %(manage_cookies_link)s.

source: How cookies are used on Check if you can get legal aid
cy: Sut mae cwcis yn cael eu defnyddio ar ‘Gwirio os ydych yn gymwys i gael cymorth cyfreithiol’

source: Measuring website usage (Google Analytics)
cy: Mesur y defnydd a wneir o’r wefan (Google Analytics)

source: We use Google Analytics software to collect information about how you use Check if you can get legal aid. We do this to help make sure the service is meeting the needs of its users and to help us make improvements.
cy: Rydym yn defnyddio meddalwedd Google Analytics i gasglu gwybodaeth ynglŷn â sut rydych yn defnyddio ‘Gwirio os ydych yn gymwys i gael cymorth cyfreithiol’. Rydym yn gwneud hyn i helpu i sicrhau bod y gwasanaeth yn diwallu anghenion ei ddefnyddwyr ac i’n helpu i wneud gwelliannau.

source: Google Analytics stores information about:
cy: Mae Google Analytics yn storio gwybodaeth am y canlynol:

source: the pages you visit
cy: y tudalennau rydych yn ymweld â nhw

source: how long you spend on each page
cy: faint o amser rydych yn ei dreulio ar bob tudalen

source: how you got to the site
cy: sut y cyrhaeddoch chi’r safle

source: what you click on while you’re visiting the site.
cy: yr hyn yr ydych yn glicio arno tra’r ydych yn ymweld â’r safle

source: We don’t collect or store your personal information so this information can’t be used to identify who you are. For more information visit our <a href="/privacy">Privacy policy</a>.
cy: Nid ydym yn casglu nac yn storio eich gwybodaeth bersonol, felly ni ellir defnyddio’r wybodaeth hon i ddatgelu pwy ydych chi. Am ragor o wybodaeth, darllenwch eich <a href="/privacy">Polisi Preifatrwydd</a>

source: We don’t allow Google to use or share our analytics data.
cy: Nid ydym yn caniatâu i Google ddefnyddio na rhannu ein data dadansoddol

source: Google Analytics sets the following cookies:
cy: Mae Google Analytics yn gosod y cwcis canlynol:

source: Google Analytics cookies
cy: Cwcis Google Analytics

source: Name
cy: Enw

source: Purpose
cy: Pwrpas

source: Expires
cy: Dod i ben

source: This helps us count how many people visit the service. Your data is anonymised.
cy: Mae hyn yn ein helpu i gyfri faint o bobl sy’n ymweld â’r gwasanaeth. Tynnir manylion adnabod o’ch data.

source: 2 years
cy: 2 flynedd

source: Used to manage the rate at which page view requests are made. Your data is anonymised.
cy: Mae’n cael ei ddefnyddio i reoli ar ba raddfa y mae ceisiadau i weld tudalennau’n cael eu gwneud. Tynnir manylion adnabod o’ch data.

source: 10 minutes
cy: 10 munud

source: This helps us count how many people visit. Your data is anonymised.
cy: Mae hyn yn ein helpu i gyfri faint o bobl sy’n ymweld. Tynnir manylion adnabod o’ch data.

source: 24 hours
cy: 24 awr

source: opt out of Google Analytics cookies
cy: peidio â derbyn cwcis Google Analytics

source: You can %(opt_out_link)s.
cy: Gallwch ddewis %(opt_out_link)s.

source: Our introductory message
cy: Ein neges ragarweiniol

source: You may see a pop-up welcome message when you first visit GOV.UK. We’ll store a cookie so that your computer knows you’ve seen it and knows not to show it again.
cy: Efallai y byddwch yn gweld neges groeso pan fyddwch yn ymweld â GOV.UK am y tro cyntaf. Byddwn yn storio cwci fel bod eich cyfrifiadur yn gwybod eich bod wedi’i weld, ac i beidio â’i ddangos wedyn

source: Introductory cookies
cy: Cwcis cyflwyno

source: Saves a message to let us know that you have seen our cookie message
cy: Arbed neges i roi gwybod i ni eich bod wedi gweld ein neges cwci

source: 1 month
cy: 1 mis

source: Your progress when using the service
cy: Eich cynnydd wrth ddefnyddio’r gwasanaeth

source: When you use the Check if you can get legal aid service, we’ll set a cookie to remember your progress through the forms. These cookies don’t store your personal data and are deleted once you’ve completed the transaction.
cy: Pan fyddwch yn defnyddio’r gwasanaeth ‘Gwirio os ydych yn gymwys i gael cymorth cyfreithiol’, byddwn yn gosod cwci i gofio sut rydych yn symud ymlaen drwy’r ffurflenni. Nid yw’r cwcis hyn yn storio eich data personol a byddant yn cael eu dileu ar ôl i chi gwblhau’r trafodiad.

source: Progress cookies
cy: Cwcis cynnydd

source: An identifier for your session
cy: Adnabyddwr ar gyfer eich sesiwn

source: At the end of the session
cy: Ar ddiwedd y sesiwn

source: Welsh language selection
cy: Dewis yr iaith Gymraeg

source: You can choose to view this service in Welsh instead of English. If you choose Welsh, we set a cookie to remember that you have made this selection.
cy: Gallwch ddewis i ddefnyddio’r gwasanaeth hwn yn Gymraeg yn lle Saesneg. Os byddwch yn dewis Cymraeg, byddwn yn gosod cwci i gofio eich bod wedi gwneud y dewis hwn.

source: Welsh language cookies
cy: Cwcis Cymraeg

source: Change cookie settings
cy: Newid gosodiadau cwcis

source: Skip to main content
cy: Neidio i’r prif gynnwys

source: Crown copyright
cy: Hawlfraint y Goron

source: All content is available under the <a class="govuk-footer__link" href="https://www.nationalarchives.gov.uk/doc/open-government-licence/version/3/" rel="license">Open Government Licence v3.0</a>, except where otherwise stated
cy: Mae’r holl gynnwys ar gael o dan <a class="govuk-footer__link" href="https://www.nationalarchives.gov.uk/doc/open-government-licence-cymraeg/version/3/" rel="license">Drwydded Llywodraeth Agored v3.0</a>, ac eithrio lle nodir yn wahanol

source: To remember your selection of Welsh language
cy: Cofio mai Cymraeg yw eich dewis iaith

source: how cookies are used on gov.uk
cy: Sut y defnyddir cwcis ar GOV.UK

source: You can read more about %(govuk_cookies_link)s.
cy: Gallwch ddarllen mwy am %(govuk_cookies_link)s.

source: Thank you for your feedback
cy: Diolch am eich adborth

source: We use the feedback to improve the service.
cy: Rydym yn defnyddio’r adborth i wella’r gwasanaeth

source: Back to home page
cy: Yn ôl i’r hafan

source: Report a problem
cy: Adrodd am broblem

source: Do not include any personal or financial details, for example, your National Insurance or credit card numbers.
cy: Peidiwch â rhoi unrhyw fanylion personol neu fanylion ariannol, er enghraifft, eich rhif Yswiriant Gwladol neu rifau cardiau credyd.

source: Continue to contact CLA
cy: Parhau i gysylltu â CLA

source: Legal aid is available for this type of problem
cy: Mae cymorth cyfreithiol ar gael ar gyfer y math hwn o broblem

source: To qualify for legal aid:
cy: I fod yn gymwys i gael cymorth cyfreithiol:

source: your income (or combined income if you have a partner) shouldn’t be more than £2,657 a month before tax
cy: rhaid i’ch incwm (neu incwm ar y cyd os oes partner gennych) fod yn ddim mwy na £2,657 y mis cyn talu treth

source: your savings (or combined savings if you have a partner) shouldn’t be more than £8,000
cy: rhaid i’ch cynilion (neu gynilion ar y cyd os oes partner gennych) fod yn ddim mwy na £8,000

source: These limits can vary in certain circumstances – for example, if you need advice about domestic abuse.
cy: Gall y cyfyngiadau hyn amrywio mewn rhai amgylchiadau - er enghraifft, os oes arnoch angen cyngor am gam-drin domestig

source: However, you must also qualify financially.
cy: Fodd bynnag, mae’n rhaid i chi fod yn gymwys yn ariannol hefyd.

source: If you do qualify financially, you’ll be able to speak to Civil Legal Advice (CLA), a national helpline for certain legal aid problems in England and Wales.
cy: Os ydych chi’n gymwys yn ariannol, mae’n bosibl y byddwch chi’n gallu cael help gan Gyngor Cyfreithiol Sifil (CLA), llinell gynghori genedlaethol ar gyfer rhai problemau cymorth cyfreithiol yng Nghymru a Lloegr.

source: The CLA operator will check all the information you’ve given through this service.
cy: Bydd yr gweithredwr CLA yn gwirio’r holl wybodaeth yr ydych wedi ei rhoi i ni drwy’r gwasanaeth hwn.

source: You’ll need to provide evidence of your finances and a specialist will ask you about your case in more detail before your application can progress.
cy: Bydd arnoch angen darparu tystiolaeth o’ch sefyllfa ariannol a bydd arbenigwr yn gofyn cwestiynau i chi ynglŷn â’ch achos yn fanylach cyn y gellir mynd ymlaen â’ch cais.

source: To complete the financial assessment, you and your partner (if you have one) will need:
cy: I gwblhau’r asesiad ariannol, bydd arnoch chi a’ch partner (os oes gennych chi un) angen:

source: recent payslips (if you’re working) and bank statements
cy: slipiau cyflog (os ydych yn gweithio) a chyfriflenni banc diweddar

source: a summary of your income tax and National Insurance contributions
cy: crynodeb o’ch cyfraniadau treth incwm a chyfraniadau Yswiriant Gwladol

source: details of any savings and investments you have
cy: manylion unrhyw gynilion a buddsoddiadau sydd gennych chi

source: details of any benefits you receive
cy: manylion unrhyw fudd-daliadau yr ydych chi’n eu cael

source: mortgage statements and a current valuation for any property you own
cy: datganiadau morgais a phrisiad cyfredol ar unrhyw eiddo yr ydych chi’n berchen arno

source: If you’re under 18, you should <a class="govuk-link" href="%(url)s">contact CLA</a> without completing the financial assessment.
cy: Os ydych o dan 18 oed, dylech <a class="govuk-link" href="%(url)s">gysylltu â’r CLA</a> heb gwblhau’r asesiad ariannol.

source: If you’re deaf or hard of hearing you can book a <a class="govuk-link" href="http://www.interpretingline.co.uk/vbooking.html" rel="external">British Sign Language interpreter</a> by completing a request form. Once complete, the operator will get back to you to complete the eligibility check and provide any further advice.
cy: Os ydych yn fyddar neu’n drwm eich clyw gallwch lenwi ffurflen gais i ofyn am <a class="govuk-link" href="http://www.interpretingline.co.uk/vbooking.html" rel="external">ddehonglydd Iaith Arwyddion Prydain</a>. Ar ôl i chi lenwi’r ffurflen, bydd y gweithredwr yn dod yn ôl atoch i gwblhau’r gwiriad cymhwystra a rhoi unrhyw gyngor arall.

source: Check if you qualify financially
cy: Gwirio a ydych yn gymwys yn ariannol

source: Before you start
cy: Cyn ichi ddechrau

source: Alternatively, you can ask a legal aid adviser to take on your case.
cy: Neu, gallwch ofyn i gynghorydd cymorth cyfreithiol ymdrin â’ch achos.

source: Your adviser will check whether you qualify for legal aid at no cost to you by asking about your problem and your finances.
cy: Bydd eich cynghorydd yn gwirio a ydych yn gymwys i gael cymorth cyfreithiol yn ddi-dâl drwy ofyn cwestiynau i chi ynglŷn â’r mater dan sylw a’ch sefyllfa ariannol.

source: If you qualify, in some cases you may need to pay a contribution towards your legal aid.
cy: Mewn rhai achosion, os ydych yn gymwys, mae’n bosibl y bydd angen i chi dalu cyfraniad tuag at eich cymorth cyfreithiol.

source: Find a legal adviser
cy: Dod o hyd i gynghorydd cyfreithiol

source: Other sources of help
cy: Ffynonellau cymorth eraill

source: You can also get advice from alternative help organisations for issues related to %(category_name)s.
cy: Gallwch hefyd gael cyngor gan sefydliadau cymorth amgen ar gyfer materion sy’n ymwneud â %(category_name)s.

source: You don’t have to qualify for legal aid.
cy: Nid oes rhaid i chi fod yn gymwys i gael cymorth cyfreithiol.

source: Find a legal aid adviser or family mediator
cy: Dewch o hyd i gynghorydd cymorth cyfreithiol neu gyfryngwr teulu

source: Find a legal aid adviser
cy: Dod o hyd i gynghorydd cymorth cyfreithiol

source: Search for a legal adviser or family mediator with a legal aid contract in England and Wales.
cy: Chwiliwch am gynghorydd cyfreithiol neu gyfryngwr teulu gyda chontract cymorth cyfreithiol yng Nghymru a Lloegr

source: Search for a legal adviser with a legal aid contract in England and Wales.
cy: Chwilio am gynghorydd cyfreithiol sydd â chontract cymorth cyfreithiol yng Nghymru a Lloegr.

source: It can be easy for other people to see what you’re doing online, especially if you’re using a home computer.
cy: Gallai fod yn haws i bobl eraill weld beth rydych yn ei wneud ar-lein, yn enwedig os ydych yn defnyddio cyfrifiadur cartref.

source: You can make it more difficult by following the tips below. But your safest option is to use a different computer - for example, at your local library - or someone else’s mobile.
cy: Gallwch ei wneud yn anoddach drwy ddilyn yr awgrymiadau isod. Ond eich opsiwn mwyaf diogel fyddai defnyddio cyfrifiadur arall - er enghraifft, yn eich llyfrgell lleol - neu ar ffôn symudol rhywun arall.

source: How others can see where you’ve been
cy: Sut y gall eraill weld ble’r ydych wedi bod

source: Every time you use the internet your browser stores a record of what you’ve done with:
cy: Bob tro rydych yn defnyddio’r rhyngrwyd, mae eich porwr yn cadw cofnod o beth rydych wedi’i wneud gyda:

source: a list of the pages you’ve looked at and the files you’ve downloaded
cy: rhestr o’r tudalennau rydych wedi edrych arnynt a’r ffeiliau rydych wedi’u lawrlwytho

source: text files called cookies which remember your settings for different sites
cy: ffeiliau testun o’r enw cwcis sy’n cofio eich gosodiadau ar gyfer safleodd gwahanol

source: How to cover your tracks
cy: Sut i guddio’ch ôl

source: You can improve your safety by deleting your history. But you need to be careful because:
cy: Gallwch wneud eich hun yn fwy diogel drwy ddileu eich hanes. Ond mae angen i chi fod yn ofalus oherwydd:

source: deleting cookies will also get rid of stored passwords for online accounts
cy: bydd dileu cwcis yn cael gwared â chyfrineiriau cyfrifon ar-lein hefyd

source: clearing your history could make someone more suspicious
cy: gall dileu’r hanes wneud rhywun yn fwy amheus

source: So just remove information about the websites you want to keep private. You can do that on:
cy: Felly, tynnwch wybodaeth am y gwefannau yr hoffech eu cadw’n breifat yn unig. Gallwch wneud hyn yn:

source: Browsing in private
cy: Pori’n breifat

source: You can also look at a website without information like cookies being stored by using the private browsing setting in your browser. Go to the menu, click on ‘File’ and choose:
cy: Hefyd, gallwch edrych ar wefan heb i wybodaeth fel cwcis gael eu storio drwy ddefnyddio’r gosodiad pori preifat yn eich porwr. Ewch i’r ddewislen, cliciwch ar ‘Ffeil’ a dewiswch:

source: <strong>InPrivate</strong> on Internet Explorer
cy: <strong>Pori InPrivate</strong> ar Internet Explorer

source: <strong>Private Browsing</strong> on Mozilla Firefox or Opera
cy: <strong>Pori Preifat</strong> ar Mozilla Firefox neu Opera

source: <strong>Incognito</strong> on Google Chrome
cy: <strong>Incognito</strong> ar Google Chrome

source: <strong>Private Window</strong> on Safari
cy: <strong>Ffenestr Breifat</strong> ar Safari

source: Privacy Statement
cy: Datganiad Preifatrwydd

source: Terms and conditions and privacy
cy: Telerau ac Amodau a phreifatrwydd
