Repository: ministryofjustice/cla_public
Catalog: cla_public/translations/*/LC_MESSAGES/messages.po
Languages: cy

source: When using this service you agree to the terms of use for both <a class="govuk-link" href="http://gov.uk/help/terms-conditions">gov.uk/help/terms-conditions</a> as well as the terms and conditions specific to this service found below.
cy: Pan fyddwch yn defnyddio’r gwasanaeth hwn, byddwch yn cytuno i delerau defnydd <a class="govuk-link" href="http://gov.uk/help/terms-conditions">gov.uk</a> yn ogystal â thelerau ac amodau penodol ar gyfer y gwasanaeth hwn fel y nodir isod.

source: If you do not agree to these terms and privacy policy, do not use this service.
cy: Os nad ydych yn cytuno â’r telerau hyn a’r polisi preifatrwydd, peidiwch â defnyddio’r gwasanaeth hwn.

source: Who manages this digital service and Civil Legal Advice
cy: Pwy sy’n rheoli’r gwasanaeth digidol hwn a Chyngor Cyfreithiol Sifil

source: The Legal Aid Agency (<abbr>LAA</abbr>) is responsible for the Civil Legal Advice (<abbr>CLA</abbr>) service. The <abbr title="Legal Aid Agency">LAA</abbr> works with other organisations who deliver the <abbr title="Civil Legal Advice">CLA</abbr> service. For example this digital service is managed by the Ministry of Justice (<abbr>MoJ</abbr>).
cy: Yr Asiantaeth Cymorth Cyfreithiol (LAA) sy’n gyfrifol am y gwasanaeth Cyngor Cyfreithiol Sifil (<abbr>CLA</abbr>). Mae’r Asiantaeth Cymorth Cyfreithiol yn gweithio gyda sefydliadau eraill sy’n darparu’r gwasanaeth CLA. Er enghraifft, mae’r gwasanaeth digidol hwn yn cael ei reoli gan y Weinyddiaeth Gyfiawnder.

source: When you first make contact with <abbr title="Civil Legal Advice">CLA</abbr> you will communicate with the <abbr title="Civil Legal Advice">CLA</abbr> Operator Service (CLAOS), which is delivered by Hinduja Global Solutions UK Limited.
cy: Y tro cyntaf y byddwch yn dod i gysylltiad â <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> byddwch yn cyfathrebu â Gwasanaeth Gweithredwr y CLA (CLAOS), sy’n cael ei ddarparu gan Hinduja Global Solutions UK Limited.

source: Hinduja Global Solutions UK Limited is a contractor employed by the <abbr title="Legal Aid Agency">LAA</abbr> to deliver the <abbr title="Civil Legal Advice">CLA</abbr> Operator Service.
cy: Contractwr sy’n cael ei gyflogi gan yr Asiantaeth Cymorth Cyfreithiol i ddarparu Gwasanaeth Gweithredwr y <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yw Hinduja Global Solutions UK Limited.

source: Complaints
cy: Cwynion

source: If you would like to make a complaint about this service or Civil Legal Advice please contact <abbr title="Civil Legal Advice">CLA</abbr> on 0345 345 4 345.
cy: Os ydych chi’n dymuno gwneud cwyn am y gwasanaeth hwn neu Gyngor Cyfreithiol Sifil, cysylltwch â <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> ar 0345 345 4 345

source: How is my privacy protected?
cy: Sut yr ydych chi’n diogelu fy mhreifatrwydd?

source: Protecting your privacy is important to us. You can use this service to find out if you might qualify for legal aid without providing any personal information that could identify you.
cy: Mae diogelu’ch preifatrwydd yn bwysig i ni. Gallwch chi ddefnyddio’r gwasanaeth hwn i gael gwybod a allech fod yn gymwys i gael cymorth cyfreithiol heb ddarparu unrhyw wybodaeth bersonol a allai ddangos pwy ydych chi.

source: We only save the information you enter if you decide to contact a Civil Legal Advice operator.
cy: Dim ond os byddwch chi’n penderfynu cysylltu â gweithredwr Cyngor Cyfreithiol Sifil y byddwn ni’n cadw’r wybodaeth yr ydych chi’n ei rhoi.

source: At this point, you will need to tell us your name and phone number and all the information you’ve entered will be stored when you click ‘Submit your application’. We store this information so that the operator can see it when they speak to you.
cy: Yn awr, bydd angen i chi roi’ch enw a’ch rhif ffôn i ni a bydd yr holl wybodaeth yr ydych wedi’i rhoi yn cael ei storio pan fyddwch chi’n clicio ar ‘Cyflwyno’ch cais’. Rydyn ni’n storio’r wybodaeth hon fel y gall gweithredwr ei gweld pan fydd yn siarad â chi.

source: If you don’t want to speak to an operator, you don’t need to enter any personal details and we don’t store any of the information you have entered.
cy: Os nad ydych chi am siarad â gweithredwr, ni fydd angen i chi roi unrhyw fanylion personol a ni fyddwn ni’n storio unrhyw wybodaeth yr ydych chi wedi’i rhoi.

source: To provide you with the best service that we can, Civil Legal Advice may share some information about you with other organisations. But we will only do this, if you have given us permission or when we have a lawful basis for doing so.
cy: Er mwyn darparu’r gwasanaeth gorau posibl i chi, mae’n bosibl y bydd Cyngor Cyfreithiol Sifil yn rhannu rhywfaint o wybodaeth amdanoch gyda sefydliadau eraill. Ond ni fyddwn yn gwneud hyn oni bai eich bod wedi rhoi caniatâd i ni, neu os oes gennym sail gyfreithlon i wneud hynny.

source: In exceptional circumstances, we may share limited information about you without your consent. This would only be to prevent fraud, to help detect crime, if it is required by law or by a court order or if we are very worried about your safety or the safety of others.
cy: Mewn amgylchiadau eithriadol, mae’n bosibl y byddwn yn rhannu ychydig o wybodaeth amdanoch heb eich caniatâd. Yr unig adeg y byddwn yn gwneud hyn yw er mwyn atal twyll, a helpu i ganfod troseddau, os yw’n ofynnol dan y gyfraith neu drwy orchymyn llys neu os ydym yn pryderu’n fawr am eich diogelwch chi neu ddiogelwch pobl eraill.

source: In order to provide a service to you, Civil Legal Advice (<abbr title="Civil Legal Advice">CLA</abbr>) may need to view, collect, record and hold (‘process’) personal data about you.
cy: Er mwyn darparu gwasanaeth i chi, mae’n bosibl y bydd angen i Gyngor Cyfreithiol Sifil (<abbr>CLA</abbr>) weld, casglu, cofnodi a dal (‘prosesu’) data personol amdanoch chi.

source: Personal data is information about you as an individual. It can be your name, address or telephone number. It can also include the information that you have provided in this form, such as your financial circumstances.
cy: Mae data personol yn wybodaeth amdanoch chi fel unigolyn. Gall gynnwys eich enw, eich cyfeiriad neu eich rhif ffôn. Gall hefyd gynnwys gwybodaeth rydych wedi’i rhoi yn y ffurflen hon, er enghraifft eich amgylchiadau ariannol.

source: This statement explains how <abbr>CLA</abbr> will process any personal data that we collect from you or that you provide to us.
cy: Mae’r datganiad hwn yn egluro sut y bydd CLA yn prosesu unrhyw ddata personol y byddwn yn eu casglu oddi wrthych neu y byddwch yn eu darparu i ni.

source: The Legal Aid Agency (<abbr>LAA</abbr>) is responsible for <abbr title="Civil Legal Advice">CLA</abbr> service and the Ministry of Justice (<abbr>MoJ</abbr>) is the Data Controller. The Legal Aid Agency (<abbr>LAA</abbr>) is an Executive Agency of the <abbr title="Ministry of Justice">MoJ</abbr>.
cy: Yr Asiantaeth Cymorth Cyfreithiol (<abbr>LAA</abbr>) sy’n gyfrifol am y gwasanaeth <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr>, a’r Weinyddiaeth Gyfiawnder yw Rheolwr y Data. Mae’r Asiantaeth Cymorth Cyfreithiol yn Asiantaeth Weithredol i’r Weinyddiaeth Gyfiawnder.

source: The <abbr title="Legal Aid Agency">LAA</abbr> works with other organisations who deliver the <abbr>CLA</abbr> service. For example, when you first make contact with <abbr>CLA</abbr>, you will communicate with the <abbr>CLA</abbr> Operator Service, which is delivered by Hinduja Global Solutions UK Limited (a contractor employed by the <abbr title="Legal Aid Agency">LAA</abbr>).
cy: Mae’r Asiantaeth Cymorth Cyfreithiol yn gweithio gyda sefydliadau eraill sy’n darparu’r gwasanaeth <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr>. Er enghraifft, y tro cyntaf y byddwch yn dod i gysylltiad â <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr>, byddwch yn cyfathrebu â Gwasanaeth Gweithredwr y <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr>, sy’n cael ei ddarparu gan Hinduja Global Solutions UK Limited (contractwr sy’n cael ei gyflogi gan yr Asiantaeth Cymorth Cyfreithiol).

source: Once you have contacted the <abbr>CLA</abbr> Operator Service, if you are likely to qualify for Legal Aid, the operator will transfer you to a <abbr>CLA</abbr> Specialist Provider. If you do not qualify to receive <abbr>CLA</abbr> Specialist advice, the operator will inform you accordingly and direct you to alternative sources of help.
cy: Ar ôl i chi gysylltu â Gwasanaeth Gweithredwr y <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr>, os ydych yn debygol o fod yn gymwys i gael Cymorth Cyfreithiol bydd y gweithredwr yn eich trosglwyddo i Ddarparwr <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> Arbenigol. Os nad ydych yn gymwys i dderbyn cyngor Arbenigwr <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr>, bydd y gweithredwr yn dweud wrthych ac yn eich cyfeirio at ffynonellau cymorth eraill.

source: The <abbr>CLA</abbr> service is committed to following this Privacy Statement. <abbr>CLA</abbr> Specialists must also adhere to their own internal privacy policy.
cy: Mae gwasanaeth <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> wedi ymrwymo i gydymffurfio â’r Datganiad Preifatrwydd hwn. Hefyd rhaid i Arbenigwyr <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> gydymffurfio â’u polisi preifatrwydd mewnol eu hunain.

source: What types of personal data do we process?
cy: Pa fathau o ddata personol rydym yn eu prosesu?

source: <abbr title="Civil Legal Advice">CLA</abbr> will only collect the minimum amount of information that is necessary and relevant, in order to deliver the <abbr>CLA</abbr> service to you.
cy: Ni fydd <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yn casglu mwy o wybodaeth nag sy’n angenrheidiol ac yn berthnasol er mwyn darparu’r gwasanaeth <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> i chi.

source: The kind of information <abbr>CLA</abbr> may collect about you includes:
cy: Y math o wybodaeth y gall <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> ei chasglu amdanoch chi yw:

source: Personal details including your name, address, date of birth, contact details, diversity monitoring information and national insurance number;
cy: Manylion personol gan gynnwys eich enw, cyfeiriad, dyddiad geni, manylion cysylltu, gwybodaeth ar gyfer monitro amrywiaeth a’ch rhif yswiriant gwladol;

source: Financial information needed to determine if you qualify for legal aid;
cy: Gwybodaeth ariannol sydd ei hangen i bennu a ydych chi’n gymwys i gael cymorth cyfreithiol;

source: Reason for contacting <abbr>CLA</abbr>, such as the nature of your problem or specific details about your situation;
cy: Y rheswm dros gysylltu â <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr>, er enghraifft, natur eich problem neu fanylion penodol am eich sefyllfa;

source: Details of any specific needs that you may have in order to access the <abbr>CLA</abbr> service; and
cy: Manylion unrhyw anghenion penodol sydd gennych er mwyn cael mynediad at wasanaeth <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr>; a

source: Responses to any customer satisfaction survey or details of any feedback, complaints or requests for a review of our decision about whether you qualify for legal aid.
cy: Ymatebion i unrhyw arolwg o fodlonrwydd cwsmeriaid neu fanylion am unrhyw adborth, cwynion neu geisiadau am adolygu ein penderfyniad ynghylch a ydych chi’n gymwys i gael cymorth cyfreithiol.

source: The amount of information <abbr>CLA</abbr> will collect will depend on whether you qualify for the <abbr>CLA</abbr> service and/or your specific needs. For example, you will be asked to provide more information before we can transfer you through to a <abbr>CLA</abbr> Specialist.
cy: Bydd faint o wybodaeth y bydd <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yn ei gasglu amdanoch yn amrywio gan ddibynnu a ydych yn gymwys ar gyfer y gwasanaeth <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr>, a/neu a oes gennych anghenion penodol. Er enghraifft, gofynnir i chi roi mwy o wybodaeth cyn y gallwn eich trosglwyddo at Arbenigwr <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr>.

source: How does <abbr>CLA</abbr> use your data and why?
cy: Sut mae <abbr>CLA</abbr> yn defnyddio eich data a pham?

source: collects and records information about you to:
cy: Mae <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yn casglu ac yn cofnodi gwybodaeth amdanoch chi er mwyn:

source: Work out whether you qualify for legal aid;
cy: Canfod a ydych yn gymwys i gael cymorth cyfreithiol;

source: Provide information and/or advice services to you;
cy: Darparu gwybodaeth a/neu wasanaethau cyngor i chi;

source: Save you from repeating information every time you contact us;
cy: Eich arbed rhag ailadrodd gwybodaeth bob tro y byddwch yn cysylltu â ni;

source: Help us monitor and improve our service;
cy: Ein helpu i fonitro a gwella ein gwasanaeth;

source: Build statistics about the <abbr>CLA</abbr> service, monitor fraud and justify public expenditure. This information is collated in an anonymous format;
cy: Adeiladu ystadegau am y gwasanaeth <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr>, monitro twyll a chyfiawnhau gwariant cyhoeddus. Mae’r wybodaeth hon yn cael ei choladu mewn fformat dienw;

source: Collect views on the <abbr>CLA</abbr> service and any improvements considered necessary. Where consent is provided, <abbr>CLA</abbr> User contact details may be passed onto an independent research agency;
cy: Casglu barn am y gwasanaeth <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> ac unrhyw welliannau y credir bod eu hangen. Lle rhoddir cydsyniad, mae’n bosibl y bydd manylion cysylltu defnyddiwr <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yn cael eu pasio ymlaen i asiantaeth ymchwil annibynnol;

source: Prevent or detect crime or fraud; and
cy: Atal neu ganfod troseddau neu dwyll;

source: Conduct occasional assurance audits to ensure that the decisions we make are correct and accurate.
cy: Cynnal archwiliadau sicrwydd achlysurol er mwyn sicrhau bod y penderfyniadau rydym yn eu gwneud yn gywir.

source: Without this information, <abbr>CLA</abbr> would not be able to conduct the activities above which are essential to the delivery of legal aid.
cy: Heb yr wybodaeth hon, ni fyddai <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yn gallu cynnal y gweithgareddau uchod sy’n hanfodol er mwyn darparu cymorth cyfreithiol.

source: The lawful basis for <abbr>CLA</abbr> collecting and processing your personal data is the result of the powers contained in legislation, specifically the Legal Aid, Sentencing and Punishment of Offenders Act 2012.
cy: Mae’r sail gyfreithlon sy’n caniatáu i <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> gasglu a phrosesu eich data personol yn deillio o’r pwerau sydd wedi’u cynnwys mewn deddfwriaeth, yn fwyaf penodol, Deddf Cymorth Cyfreithiol Dedfrydu a Chosbi Troseddwyr 2012.

source: <abbr>CLA</abbr> also collects ‘special categories of personal data’ for the purposes of monitoring equality. This is a legal requirement for public authorities, under the Equality Act 2010. Special categories of personal data obtained for equality monitoring will be treated with the strictest confidence and any information published will not identify you or anyone else associated with your legal aid application.
cy: Mae <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> hefyd yn casglu ‘categorïau arbennig o ddata personol’ at ddibenion monitro cydraddoldeb. Mae Deddf Cydraddoldeb 2010 yn nodi ei bod yn ofynnol i awdurdodau cyhoeddus wneud hyn. Byddwn yn trin categorïau arbennig o ddata personol a gesglir er mwyn monitro cydraddoldeb yn gwbl gyfrinachol ac ni fydd unrhyw wybodaeth a gyhoeddir yn nodi pwy ydych chi na neb arall sy’n gysylltiedig â’ch cais am gymorth cyfreithiol.

source: Given the purposes for which your personal data may be used (as referred to above) it is essential that the information you provide is accurate and complete.
cy: Oherwydd y dibenion y gellir defnyddio eich data personol ar eu cyfer (sydd wedi’u nodi uchod), mae’n hanfodol eich bod yn darparu gwybodaeth sy’n gywir a chyflawn.

source: How does <abbr>CLA</abbr> collect your personal data and keep it safe?
cy: Sut y mae <abbr>CLA</abbr> yn casglu’ch data personol ac yn eu cadw’n ddiogel?

source: <abbr>CLA</abbr> may collect personal data about you by phone, online, email or post (see table below). Any personal data will be recorded and stored within a secure system that meets required Government standards.
cy: Gall <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> gasglu data personol amdanoch chi dros y ffôn, ar-lein, drwy’r post a’r e-bost (gweler y tabl isod). Bydd unrhyw ddata personol yn cael eu cofnodi a’u storio mewn system ddiogel sy’n cyrraedd safonau sydd wedi’u gosod gan y Llywodraeth.

source: <abbr>CLA</abbr> will be able to view and verify the information that you provide and, where necessary, will amend it to maintain its accuracy.
cy: Bydd <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yn gallu gweld a gwirio’r wybodaeth y byddwch yn ei rhoi a, lle bo angen, bydd yn diwygio’r wybodaeth er mwyn sicrhau ei bod yn gywir.

source: The minimum amount of personal data that <abbr>CLA</abbr> will ask to collect is your name and two other pieces of personal information that could be used to identify you, e.g. postcode, date of birth or telephone number.
cy: Y data personol sylfaenol y bydd <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yn gofyn amdanynt yw eich enw a dau ddarn arall o wybodaeth bersonol a allai gael eu defnyddio i’ch adnabod, e.e. côd post, dyddiad geni neu rif ffôn.

source: As your personal data is stored on our IT infrastructure, and shared with our data processors, it may be transferred and stored securely outside the European Economic Area (EEA). Where that is the case, it will be subject to equivalent legal protection through the use of Model Contract Clauses.
cy: Gan fod eich data personol yn cael eu storio ar ein seilwaith TG, ac yn cael eu rhannu â’n proseswyr data, mae’n bosibl y byddant yn cael eu trosglwyddo a’u storio’n ddiogel y tu allan i’r Ardal Economaidd Ewropeaidd (EEA). Os bydd hynny’n digwydd, byddant yn ddarostyngedig i amddiffyniad cyfreithiol cyfatebol drwy gyfrwng Cymalau Contract Enghreifftiol.

source: Any transfers made will be in full compliance with all aspects of the data protection law.
cy: Bydd unrhyw drawsyrru data yn cydymffurfio’n llwyr â phob agwedd ar y gyfraith diogelu data.

source: By submitting your personal data, you agree to information being recorded, used and stored as outlined in this Privacy Statement.
cy: Drwy gyflwyno’ch data personol, rydych chi’n cytuno i’r wybodaeth gael ei chofnodi, ei defnyddio a’i storio’n unol â’r Datganiad Preifatrwydd hwn.

source: How we collect and store your personal data
cy: Sut yr ydym yn casglu ac yn storio’ch data personol

source: Phone
cy: Ffôn

source: When you call <abbr>CLA</abbr> we will record relevant personal data that you provide within a secure digital system. <br><br> We may also record your calls. But you can choose to opt out of this or choose whether or not to continue with the call. <br><br> If you leave <abbr>CLA</abbr> a voice message we will record the minimum amount of information required in order to contact you back.
cy: Pan fyddwch chi’n ffonio <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr>, byddwn ni’n cofnodi data personol perthnasol yr ydych chi’n eu rhoi mewn system ddigidol ddiogel. Gallwn recordio’ch galwadau hefyd. Ond cewch chi ddewis peidio ag ymuno â hyn neu ddewis a ydych chi am barhau â’r alwad neu beidio. Os byddwch chi’n gadael neges llais i <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr>, byddwn ni’n cofnodi’r lleiaf o wybodaeth sydd ei hangen i gysylltu â chi wedyn.

source: Online
cy: Ar-lein

source: When you contact <abbr>CLA</abbr> online, the personal data that you provide will be recorded within a secure digital system. <br><br> Please note that transmitting information over the internet is generally not completely secure, and <abbr>CLA</abbr> can’t guarantee the security of your data. Any data you transmit is at your own risk. <abbr>CLA</abbr> have procedures and security features in place to keep your data secure once we receive it.
cy: Pan fyddwch yn cysylltu â <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> ar-lein, bydd y data personol y byddwch yn eu rhoi yn cael eu cofnodi mewn system ddigidol ddiogel. Sylwer nad yw trawsyrru gwybodaeth dros y rhyngrwyd yn gwbl ddiogel bob amser, ac ni all <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> warantu diogelwch eich data. Ni allwn fod yn gyfrifol am unrhyw ddata y byddwch yn eu trawsyrru. Mae gan <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> weithdrefnau a nodweddion diogelwch er mwyn cadw eich data’n ddiogel ar ôl i ni eu derbyn.

source: Transmitting information via email is generally not completely secure, and <abbr>CLA</abbr> can’t guarantee the security of your data. Any data you transmit is at your own risk. <br><br> <abbr>CLA</abbr> have procedures and security features in place to keep your data secure once we receive it. <br><br> When you email <abbr>CLA</abbr>, relevant personal data that you provide will be recorded within a secure digital system. <br><br> <abbr>CLA</abbr> may monitor and store both your incoming and outgoing emails. We may also use blocking software.
cy: Nid yw trawsyrru gwybodaeth drwy e-bost yn gwbl ddiogel bob amser, ac ni all <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> warantu diogelwch eich data. Ni allwn fod yn gyfrifol am unrhyw ddata y byddwch yn eu trawsyrru. Mae gan CLA weithdrefnau a nodweddion diogelwch i gadw eich data’n ddiogel ar ôl i ni eu derbyn. Pan fyddwch yn anfon e-bost i CLA, bydd data personol perthnasol y byddwch yn eu rhoi yn cael eu cofnodi mewn system ddigidol ddiogel. Mae’n bosibl y bydd CLA yn monitro ac yn storio negeseuon e-bost y byddwch yn eu derbyn ac yn eu hanfon. Mae’n bosibl hefyd y byddwn yn defnyddio meddalwedd blocio.

source: When <abbr>CLA</abbr> receives post we may record relevant personal data included within a secure digital system. <br><br> <abbr>CLA</abbr> may also retain original hard-copies of information submitted by you. This must be stored in a locked filing cabinet. Digital copies of letters may be scanned and stored.
cy: Pan fydd <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yn derbyn llythyrau, gallwn ni gofnodi data personol perthnasol sydd ynddynt mewn system ddigidol ddiogel. Hefyd gall <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> gadw llythyrau gwreiddiol sy’n cynnwys gwybodaeth a gyflwynwyd gennych chi. Rhaid storio’r rhain mewn cwpwrdd ffeiliau sydd wedi’i gloi. Gellir sganio copïau digidol o lythyrau a’u storio.

source: Keeping your personal data safe from others
cy: Cadw’ch data personol yn ddiogel oddi wrth eraill

source: Repeat Contacts
cy: Ailgysylltu

source: <abbr>CLA</abbr> will not disclose any personal information to anyone contacting the <abbr>CLA</abbr> service until they have successfully verified that their identity matches that of an existing record.
cy: Ni fydd <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> yn datgelu unrhyw wybodaeth bersonol i rywun sy’n cysylltu â gwasanaeth <abbr title="Cyngor Cyfreithiol Sifil">CLA</abbr> nes ei fod wedi cadarnhau bod ei hunaniaeth yn cyfateb i gofnod sy’n bodoli.

source: Third-parties
cy: Trydydd parti
